-- СКРИПТ СИНХРОНИЗАЦИИ ВЕРСИЙ БД DECANET
-- --------------------------------------
-- v0.016 2009-01-18
-- --------------------------------------
USE decanet;
USE decanet;

DELIMITER $$

-- существование индекса
-- DROP FUNCTION IF EXISTS decanet.INDEXEXISTS $$
DROP FUNCTION IF EXISTS INDEXEXISTS $$
CREATE FUNCTION decanet.INDEXEXISTS(IDXNAME VARCHAR(64), TBLNAME VARCHAR(64)) RETURNS BOOL
BEGIN
  RETURN EXISTS (SELECT *
                  FROM information_schema.TABLE_CONSTRAINTS T
                  WHERE TABLE_SCHEMA = 'decanet' AND
                        TABLE_NAME = TBLNAME AND
                        CONSTRAINT_NAME = IDXNAME);
END $$

-- модификация с 0.001 до 0.002
DROP PROCEDURE IF EXISTS decanet.DCVERS_0001_0002 $$
CREATE PROCEDURE decanet.DCVERS_0001_0002()
BEGIN

  ALTER TABLE decanet.student DROP COLUMN STUDENT_BUCHNO;

  ALTER TABLE decanet.SGROUP DROP COLUMN SGROUP_ACTIVE;

  ALTER TABLE decanet.CONTROL ADD COLUMN CONTROL_NAMED BOOL NOT NULL DEFAULT FALSE AFTER CONTROL_NAME;

  UPDATE decanet.CONTROL
    SET CONTROL_NAMED = TRUE
    WHERE CONTROL_ID IN (4, 5, 7, 9, 10, 12, 13);

  UPDATE decanet.STUDADD
    SET STUDENT_DESC = NULL;
END $$

-- модификация с 0.002 до 0.003
DROP PROCEDURE IF EXISTS decanet.DCVERS_0002_0003 $$
CREATE PROCEDURE decanet.DCVERS_0002_0003()
BEGIN
  REPLACE INTO PROLTYPE (PROLTYPE_ID, PROLTYPE_ABBR, PROLTYPE_NAME)
    VALUES (1, 'МедСпр', 'По состоянию здоровья'),
           (2, 'СемОбст', 'По семейным обстоятельствам');

  ALTER TABLE decanet.PROLONG ADD COLUMN PROLONG_TODATE DATE NOT NULL AFTER PROLTYPE_ID;
  ALTER TABLE decanet.student DROP COLUMN STUDSTATUS_ACTIVE;

  UPDATE decanet.document
    SET DOCUMENT_BARNO = CONCAT(FACULTET_ID, DOCUMENT_ID)
    WHERE DOCUMENT_BARNO IS NULL;

  UPDATE decanet.document
    SET DOCUMENT_TEMPFLAG = FALSE
    WHERE DOCUMENT_INDATE IS NOT NULL;

  UPDATE decanet.doctype
    SET DOCTYPE_NAME = 'Диплом'
    WHERE DOCTYPE_ID = 7;

END $$

-- модификация с 0.003 до 0.004
DROP PROCEDURE IF EXISTS decanet.DCVERS_0003_0004 $$
CREATE PROCEDURE decanet.DCVERS_0003_0004()
BEGIN
  IF NOT INDEXEXISTS('IDX_CONTINGENT_D', 'contingent') THEN
    CREATE INDEX IDX_CONTINGENT_D ON decanet.contingent(DOCUMENT_ID);
  END IF;

  INSERT INTO decanet.doctype(DOCTYPE_ID, DOCTYPE_NAME, DOCTYPE_ABBR)
    VALUES(12, 'Ведомость тем', 'ТемаВед');
END $$

-- модификация с 0.004 до 0.005
DROP PROCEDURE IF EXISTS decanet.DCVERS_0004_0005 $$
CREATE PROCEDURE decanet.DCVERS_0004_0005()
BEGIN
  -- формы обучения
  DELETE FROM decanet.eduform
    WHERE EDUFORM_ID >= 6;

  UPDATE decanet.student
    SET EDUFORM_ID = 5
    WHERE EDUFORM_ID = 3;
  DELETE FROM decanet.eduform
    WHERE EDUFORM_ID = 3;

  UPDATE decanet.eduform
    SET EDUFORM_ABBR = 'бюджет',
        EDUFORM_NAME = 'Бюджетное',
        EDUFORM_STIP = 1
    WHERE EDUFORM_ID = 1;

  UPDATE decanet.eduform
    SET EDUFORM_ABBR = 'бюджет-целевик-оплата',
        EDUFORM_NAME = 'Бюджетное целевое с оплатой',
        EDUFORM_STIP = 1
    WHERE EDUFORM_ID = 2;

  UPDATE decanet.eduform
    SET EDUFORM_ABBR = 'вне бюджет',
        EDUFORM_NAME = 'Внебюджетное',
        EDUFORM_STIP = 0
    WHERE EDUFORM_ID = 4;

  UPDATE decanet.eduform
    SET EDUFORM_ABBR = 'бюджет-целевик',
        EDUFORM_NAME = 'Бюджетное целевое',
        EDUFORM_STIP = 1
    WHERE EDUFORM_ID = 5;

  -- отделения
  UPDATE decanet.division
    SET DIVISION_ABBR = '250201',
        DIVISION_NAME = '250201 Лесное хозяйство'
    WHERE DIVISION_ID = 1;

  UPDATE decanet.division
    SET DIVISION_ABBR = '250201 (3 года)',
        DIVISION_NAME = '250201 Лесное хозяйство (3 года)'
    WHERE DIVISION_ID = 2;

  UPDATE decanet.division
    SET DIVISION_ABBR = '250100',
        DIVISION_NAME = '250100 Лесное дело'
    WHERE DIVISION_ID = 3;

  UPDATE decanet.division
    SET DIVISION_ABBR = '250203',
        DIVISION_NAME = '250203 Садово-парковое и ландшафтное строительство'
    WHERE DIVISION_ID = 4;

  UPDATE decanet.division
    SET DIVISION_ABBR = '250203 (очно-заочное)',
        DIVISION_NAME = '250203 Садово-парковое и ландшафтное строительство (очно-заочное)'
    WHERE DIVISION_ID = 5;

  UPDATE decanet.direction
    SET DIRECTION_NAME = 'Лесное дело'
    WHERE DIRECTION_ID = 2;

  INSERT INTO decanet.direction (DIRECTION_ID, DIRECTION_CODE, DIRECTION_NAME)
    VALUES (3, 120302, 'Земельный кадастр');

  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, EDUTYPE_ID, DIRECTION_ID, SPECIALITY_ID, SUBSPEC_ID,
                                DIVISION_ABBR, DIVISION_NAME,
                                DIVISION_UYEAR, DIVISION_HALFUYEAR,
                                DIVISION_ALGNO, DIVISION_DESC)
    VALUES (6, 1, 3, 1, 2, NULL, '250203 (3 года)', '250203 Садово-парковое и ландшафтное строительство (3 года)', 9, 2, 1, NULL),
           (7, 1, 3, 3, NULL, NULL, '120302', '120302 Земельный кадастр', 9, 2, 1, NULL),
           (8, 1, 3, 1, 1, NULL, '250201 (магистратура)', '250201 Лесное хозяйство (магистратура)', 9, 2, 1, NULL),
           (9, 1, 3, 1, 2, NULL, '250203 (магистратура)', '250203 Садово-парковое и ландшафтное строительство (магистратура)', 9, 2, 1, NULL);
END $$



-- модификация с 0.005 до 0.006
DROP PROCEDURE IF EXISTS decanet.DCVERS_0005_0006 $$
CREATE PROCEDURE decanet.DCVERS_0005_0006()
BEGIN
  -- Экономика отрасли vs Экономика
--  INSERT INTO decanet.subj(SUBJ_ID, SUBJ_ABBR, SUBJ_NAME)
--    VALUES (NULL, 'ЭкОтр', 'Экономика отрасли');

--  SET @SID = Last_Insert_ID();

  SET @SID = 194;

  UPDATE decanet.mprogsubj
    SET SUBJ_ID = @SID
    WHERE MAINPROG_ID = 589;

  -- ДДиЦ vs Д
  UPDATE decanet.progdoc D LEFT JOIN
         decanet.persprog P USING (PERSPROG_ID) LEFT JOIN
         decanet.acad A USING (PERSPROG_ID) LEFT JOIN
         decanet.persprog P1 ON P1.mainprog_ID = 199 AND P1.student_ID = P.student_ID
    SET D.PERSPROG_ID = P1.PERSPROG_ID,
        A.PERSPROG_ID = P1.PERSPROG_ID
    WHERE P.mainprog_ID = 200;

  SET FOREIGN_KEY_CHECKS = 0;
  -- multidelete syntax
  DELETE decanet.ACAD, decanet.document, decanet.PROGDOC, decanet.PERSPROG, decanet.MPROGSUBJ, decanet.mainprog
    FROM decanet.mainprog LEFT JOIN
         decanet.MPROGSUBJ USING (MAINPROG_ID) LEFT JOIN
         decanet.PERSPROG USING (MAINPROG_ID) LEFT JOIN
         decanet.PROGDOC USING (PERSPROG_ID) LEFT JOIN
         decanet.document USING (DOCUMENT_ID) LEFT JOIN
         decanet.ACAD USING (PERSPROG_ID, DOCUMENT_ID)
    WHERE MAINPROG_ID = 200;
  SET FOREIGN_KEY_CHECKS = 1;

  UPDATE decanet.mprogsubj
    SET SUBJ_ID = 20
    WHERE MAINPROG_ID = 199;

  -- ИГ
  DROP TABLE IF EXISTS decanet.ttIG1;
  CREATE TABLE decanet.ttIG1 (LN INT, MARK INT);

  INSERT INTO decanet.ttIG1
    VALUES (12946,3),(15026,5),(15082,4),(15084,3),(15128,3),(15156,5),(15167,3),(16440,4),(16442,4),(16443,5),(16444,5),(16446,4),(16447,5),(16448,3),(16451,4),(16452,4),(16453,5),(16454,4),(16455,4),(16456,4),(16457,4),(16458,4),(16460,5),(16461,5),(16462,5),(16463,3),(16464,5),(16465,5),(16466,4),(16467,4),(16468,4),(16469,4),(16470,5),(16471,5),(16472,3),(16473,5),(16478,4),(16479,4),(16480,4),(16481,4),(16482,4),(16483,4),(16484,4),(16485,4),(16486,4),(16487,4),(16489,5),(16490,4),(16491,4),(16494,5),(16495,4),(16496,5),(16497,5),(16498,5),(16500,5),(16502,5),(16503,5),(16504,5),(16505,5),(16506,5),(16507,4),(16509,4),(16510,5),(16511,5),(16512,4),(16513,5),(16514,4),(16515,4),(16516,5),(16517,5),(16518,5),(16519,5),(16520,5),(16521,4),(16524,5),(16525,4),(16526,4),(16528,4),(16529,5),(16534,4),(16535,5),(16536,5),(16538,5),(16539,4),(16542,5),(16543,3),(16545,4),(16548,5),(16549,5),(16553,3),(16554,4),(16572,3),(16573,4),(16575,3),(16578,5),(16579,5),(16582,3),(16583,4),(16584,3),(16585,4),(16586,3),(16587,5),(16588,3),(16589,4),(16590,4),(16592,3),(16593,4),(16594,4),(17250,3),(17251,4),(17254,4),(17255,4),(17256,5),(17257,4),(17259,5),(17260,4),(17261,4),(17262,4),(17264,4),(17266,5),(17268,3),(17269,3),(17270,4),(17271,5),(17273,4),(17274,4),(17277,4),(17279,4),(17280,5),(17281,5),(17282,4),(17284,4),(17285,4),(17286,4),(17287,5),(17288,4),(17290,4),(17294,4),(17295,4),(17301,4),(17302,4),(17303,4),(17304,4),(17305,3),(17307,3),(17308,5),(17309,4),(17311,5),(17312,4),(17313,3),(17314,5),(17317,3),(17318,4),(17319,4),(17320,5),(17321,5),(17323,4),(17325,4),(17328,4),(17329,5),(17330,4),(17331,4),(17334,5),(17335,5),(17338,4),(17339,4),(17342,3),(17343,5),(17344,5),(17347,4),(17348,4),(17349,4),(17351,4),(17352,4),(17380,4),(17383,3),(17384,3),(17386,4),(17387,4),(17388,4),(17389,5),(17390,3),(17392,4),(17393,3),(17394,5),(17396,4),(17397,4),(17398,3),(17399,4),(17400,4),(17401,4),(17403,4),(17404,4),(17406,4),(17409,4),(17411,4),(17426,5),(17432,4),(17437,3),(17442,4),(17443,4),(17449,3),(17450,4),(17453,5),(21603,5),(21604,4),(21605,4),(21606,5),(21610,5),(21611,4),(21613,4),(21614,4),(21615,4),(21617,4),(21618,4),(21620,5),(21621,4),(21622,4),(21623,3),(21625,5),(21627,4),(21630,4),(21631,5),(21632,4),(21633,5),(21634,4),(21635,4),(21638,5),(21639,5),(21640,4),(21641,4),(21642,5),(21644,4),(21645,4),(21647,4),(21649,4),(21650,4),(21651,3),(21653,4),(21654,4),(21656,5),(21657,4),(21658,5),(21659,5),(21661,4),(21662,4),(21663,4),(21665,4),(21666,4),(21667,5),(21668,4),(21669,4),(21672,4),(21673,4),(21674,5),(21676,4),(21677,4),(21680,5),(21681,4),(21682,4),(21683,4),(21685,4),(21686,4),(21687,4),(21688,4),(21689,5),(21691,4),(21692,4),(21693,4),(21695,4),(21696,4),(21697,5),(21698,4),(21699,5),(21701,5),(21702,5),(21706,4),(21707,4),(21712,4),(21714,4),(21716,4),(21722,4),(21724,5),(21725,4),(21729,4),(21731,5),(21732,4),(21733,5),(21735,4),(21736,3),(21742,4),(21743,4),(21744,4),(21746,4),(21747,4),(21749,5),(21750,4),(21751,4),(21754,3),(21755,4),(21756,4),(21758,4),(21762,4),(21763,4),(21764,4),(21765,4),(21766,4),(21767,4),(21769,4),(21771,4),(21772,4),(21774,3),(22125,4),(22126,4),(22128,5),(22129,5),(22130,4),(22132,4),(22133,4),(22134,5),(22135,5),(22138,5),(22139,5),(22142,5),(22143,5),(22144,4),(22145,4),(22147,4),(23001,3),(23002,4),(23004,4),(23005,4),(23006,4),(23010,4),(23011,4),(23013,4),(23014,4),(23015,4),(23016,3),(23017,4),(23018,4),(23019,4),(23020,4),(23021,4),(23022,4),(23023,4),(23025,4),(23026,4),(23027,5),(23028,5),(23029,5),(23030,4),(23031,4),(23032,4),(23033,4),(23034,5),(23035,4),(23036,4),(23037,4),(23038,3),(23040,4),(23041,4),(23042,3),(23043,4),(23044,4),(23045,5),(23046,4),(23047,5),(23048,4),(23049,4),(23050,4),(23051,4),(23052,4),(23054,3),(23056,3),(23057,3),(23058,3),(23059,5),(23060,4),(23061,3),(23062,4),(23063,4),(23064,4),(23066,4),(23067,3),(23068,5),(23069,4),(23070,3),(23071,4),(23073,4),(23074,5),(23092,4),(23093,5),(23094,5),(23095,5),(23096,4),(23098,4),(23099,4),(23100,4),(23101,5),(23102,5),(23103,4),(23104,5),(23106,4),(23109,4),(23112,5),(23113,5),(23114,5),(23115,5),(23117,4),(23118,4),(23120,4),(23123,5),(23159,3),(24018,4),(24095,4),(26461,4),(26462,4),(26463,3),(26464,5),(26465,4),(26466,4),(26467,5),(26468,4),(26469,5),(26470,3),(26471,5),(26472,4),(26473,4),(26474,5),(26475,3),(26476,3),(26478,3),(26479,4),(26480,4),(26481,4),(26482,3),(26483,4),(26484,4),(26485,4),(26486,4),(26488,3),(26489,4),(26490,5),(26491,5),(26493,4),(26494,3),(26495,3),(26497,5),(26499,3),(26500,4),(26502,5),(26503,4),(26505,5),(26506,5),(26507,3),(26508,4),(26509,3),(26510,5),(26511,4),(26512,4),(26513,3),(26514,3),(26515,4),(26517,4),(26518,4),(26519,3),(26520,4),(26523,5),(26524,5),(26525,4),(26526,4),(26527,3),(26528,3),(26529,4),(26531,3),(26532,3),(26547,3),(26548,4),(26549,4),(26550,3),(26551,3),(26552,5),(26554,5),(26555,4),(26556,4),(26557,4),(26562,4),(26563,4),(26564,4),(26565,5),(26566,5),(26567,5),(26569,4),(26570,3),(26571,5),(26572,5),(26573,4),(26574,4),(26576,5),(26577,4),(26578,5),(26579,5),(26580,5),(26581,4),(26582,4),(26583,4),(26584,4),(26585,5),(26586,4),(26587,5),(26588,5),(26589,5),(26590,4),(26592,4),(26595,3),(26596,3),(26598,5),(26599,3),(26600,4),(26608,3),(26609,5),(26610,3),(26611,5),(26613,4),(97445,3),(97448,3),(97452,4),(97460,3),(97464,3),(97465,3),(97466,5),(97468,4),(97473,4),(97474,4),(97475,5),(97476,4),(97477,4),(5502,3),(14530,5),(16546,4),(17252,3),(17322,4),(17346,5),(17451,4),(21643,4),(21648,5),(4857,4),(4882,5),(5535,4),(5579,3),(5609,3),(6476,5),(6496,4),(6497,5),(6548,4),(6572,5),(6602,3),(6609,3),(8303,4),(8304,5),(8305,5),(8307,4),(8308,4),(8309,4),(8311,4),(8312,5),(8313,5),(8316,3),(8319,5),(8323,5),(8324,3),(8325,4),(8326,3),(8327,3),(8328,4),(8329,4),(8330,5),(8334,5),(8337,5),(8339,3),(8340,3),(8344,3),(8347,4),(8349,4),(8350,3),(8351,5),(8355,4),(8356,4),(8358,4),(8360,4),(8363,4),(8364,3),(8366,4),(8367,4),(8368,5),(8369,3),(8370,3),(8371,4),(8372,5),(8373,3),(8375,3),(8376,4),(8377,4),(8378,5),(8380,3),(8381,3),(8382,3),(8384,5),(8385,4),(8388,4),(8389,5),(8392,3),(8393,4),(8394,5),(8395,4),(8397,4),(8398,3),(8399,4),(8400,3),(8401,3),(8402,4),(8404,3),(8407,3),(8408,3),(8411,4),(8412,4),(8413,4),(8416,5),(8418,4),(8419,4),(8420,4),(8421,3),(8422,4),(8452,3),(8460,4),(8461,3),(8462,3),(8466,3),(8562,5),(10296,5),(10297,4),(10299,5),(10301,4),(10302,5),(10305,4),(10306,4),(10307,4),(10308,5),(10311,4),(10314,4),(10315,3),(10316,5),(10318,5),(10321,5),(10322,5),(10323,5),(10324,5),(10325,4),(10326,4),(10327,4),(10328,5),(10329,4),(10330,4),(10332,4),(10333,4),(10335,4),(10336,4),(10337,4),(10338,5),(10339,3),(10340,4),(10341,5),(10342,4),(10345,3),(10348,4),(10349,4),(10351,4),(10355,3),(10356,4),(10359,4),(10361,3),(10362,5),(10363,4),(10365,5),(10366,4),(10367,4),(10368,5),(10370,4),(10371,5),(10373,4),(10374,4),(10376,3),(10377,3),(10378,4),(10380,4),(10381,4),(10384,4),(10386,5),(10388,5),(10389,3),(10390,3),(10392,4),(10394,5),(10395,4),(10396,3),(10397,4),(10399,5),(10400,4),(10402,4),(10403,4),(10404,4),(10406,5),(10412,4),(10418,5),(10420,4),(10444,3),(10445,4),(10448,4),(10449,4),(10450,3),(10451,4),(10453,4),(10454,3),(10458,4),(10770,4),(10771,3),(10794,3),(11435,4),(11436,4),(11437,5),(11438,4),(11439,4),(11440,5),(11441,4),(11443,4),(11444,4),(11446,3),(11447,5),(11448,4),(11449,4),(11450,4),(11453,5),(11454,4),(11455,4),(11456,4),(11461,3),(11462,4),(11467,4),(11468,4),(11470,4),(11471,4),(11472,4),(11473,4),(11474,4),(11475,4),(11476,4),(11477,4),(11480,4),(11481,4),(11482,5),(11483,3),(11484,5),(11486,4),(11487,4),(11488,4),(11491,3),(11492,4),(11499,5),(11500,4),(11501,5),(11502,4),(11503,3),(11504,4),(11508,5),(11510,5),(11513,4),(11516,4),(11517,5),(11518,3),(11519,4),(11520,3),(11521,3),(11522,5),(11524,5),(11534,5),(11535,4),(11538,4),(11540,4),(11541,3),(11542,5),(11544,4),(11545,5),(11546,5),(11547,3),(11549,5),(11550,4),(11551,4),(11552,3),(11566,4),(11569,4),(11570,4),(11572,3),(11573,4),(11575,5),(11577,5),(11578,4),(11580,4),(11581,4),(11583,4),(11586,3),(11588,3),(11590,5),(12163,3),(12932,3),(12934,5),(12935,5),(12937,5),(12940,4),(12941,4),(12943,4),(12945,4),(12947,4),(12948,4),(12950,5),(12951,5),(12952,4),(12953,5),(12954,4),(12955,5),(12956,4),(12957,4),(12958,5),(12960,4),(12961,5),(12962,5),(12963,5),(12964,4),(12966,4),(12967,5),(12968,4),(12969,5),(12970,3),(12971,4),(12972,4),(12973,3),(12974,5),(12975,4),(12977,5),(12978,3),(12979,5),(12980,4),(12981,4),(12982,4),(12983,4),(12986,4),(12987,3),(12988,3),(12990,5),(12991,5),(12993,5),(12995,3),(12997,5),(12999,5),(13001,5),(13004,5),(13005,4),(13006,5),(13008,4),(13009,3),(13011,4),(13012,4),(13013,4),(13015,4),(13016,4),(13017,5),(13018,5),(13020,3),(13021,3),(13022,4),(13023,4),(13025,5),(13026,4),(13033,5),(13036,5),(13037,5),(13038,5),(13039,5),(13040,4),(13041,4),(13042,3),(13043,3),(13044,5),(13045,5),(13046,4),(13047,3),(14436,5),(14438,5),(14439,4),(14441,5),(14442,5),(14444,4),(14446,4),(14447,5),(14448,5),(14449,4),(14451,3),(14452,4),(14454,5),(14457,4),(14458,4),(14459,4),(14460,5),(14461,4),(14463,4),(14465,4),(14466,4),(14470,3),(14472,4),(14473,3),(14474,5),(14476,5),(14477,4),(14478,5),(14479,5),(14480,5),(14481,3),(14482,5),(14483,4),(14486,4),(14488,4),(14489,5),(14490,3),(14491,5),(14493,4),(14494,4),(14496,3),(14498,3),(14501,4),(14504,3),(14505,4),(14506,4),(14507,3),(14509,4),(14510,5),(14513,4),(14514,4),(14518,3),(14519,4),(14520,3),(14521,5),(14522,3),(14523,3),(14525,3),(14526,4),(14534,3),(14536,4),(14539,3),(14542,5),(14546,4),(14548,4),(14550,4),(14552,4),(14556,5),(14557,5),(14558,5),(14560,5),(14561,4),(14562,5),(14563,3),(14567,5),(14591,3),(14592,3),(15019,5),(15021,4),(15022,5),(15025,4),(15027,4),(15028,3),(15030,4),(15033,3),(15035,4),(15037,5),(15038,5),(15043,3),(15044,5),(15046,3),(15049,5),(15050,4),(15051,5),(15052,5),(15054,3),(15057,4),(15058,5),(15059,4),(15060,5),(15061,4),(15062,3),(15063,4),(15067,4),(15069,5),(15071,5),(15075,4),(15076,4),(15077,3),(15079,4),(15085,5),(15086,4),(15087,4),(15088,5),(15089,5),(15090,4),(15091,5),(15092,4),(15094,5),(15095,4),(15097,4),(15100,3),(15102,5),(15104,4),(15105,5),(15106,3),(15107,5),(15111,4),(15112,4),(15115,4),(15116,4),(15117,5),(15118,4),(15119,5),(15125,4),(15127,5),(15129,5),(15132,5),(15133,4),(15136,5),(15138,3),(15141,3),(15142,5),(15143,5),(15144,5),(15145,5),(15147,5),(15150,5),(15151,5),(15153,3),(15155,5),(15157,4),(15158,4),(15162,5),(15165,5),(15172,4),(15174,4),(15178,4),(15179,3),(15180,5),(16550,5),(17454,3),(97423,4),(97429,5),(97438,5),(97440,5),(97456,5);

  UPDATE decanet.mainprog M LEFT JOIN
         decanet.MPROGSUBJ J USING (MAINPROG_ID) LEFT JOIN
         decanet.DSESSION E USING(DSESSION_ID)
    SET M.CONTROL_ID = 3
    WHERE J.SUBJ_ID = 45 AND E.SEMESTR = 1 AND M.CONTROL_ID = 2;

  UPDATE decanet.acad A LEFT JOIN
         decanet.persprog P USING (PERSPROG_ID) LEFT JOIN
         decanet.student S USING (STUDENT_ID) LEFT JOIN
         decanet.ttIG1 I ON I.LN = S.student_PERSNO LEFT JOIN
         decanet.result R ON R.RESULT_INT = I.MARK LEFT JOIN
         decanet.mainprog M USING (MAINPROG_ID) LEFT JOIN
         decanet.MPROGSUBJ J USING (MAINPROG_ID) LEFT JOIN
         decanet.DSESSION E USING (DSESSION_ID)
    SET A.RESULT_ID = R.RESULT_ID
  WHERE J.SUBJ_ID = 45 AND E.SEMESTR = 1 AND M.CONTROL_ID = 3 AND I.LN IS NOT NULL;

  DROP TABLE decanet.ttIG1;

  UPDATE decanet.mainprog M LEFT JOIN
         decanet.MPROGSUBJ J USING (MAINPROG_ID) LEFT JOIN
         decanet.DSESSION E USING(DSESSION_ID) LEFT JOIN
         decanet.persprog P USING (MAINPROG_ID) LEFT JOIN
         decanet.acad A USING (PERSPROG_ID) LEFT JOIN
         decanet.progdoc R USING (PERSPROG_ID) LEFT JOIN
         decanet.document D ON R.document_ID = D.document_ID
  SET D.document_TEMPFLAG = 1
  WHERE J.SUBJ_ID = 45 AND E.SEMESTR = 1 AND M.CONTROL_ID = 3 AND A.RESULT_ID IN (5,6) AND D.doctype_ID = 2;

  DELETE decanet.acad
    FROM decanet.acad LEFT JOIN
         decanet.persprog USING (PERSPROG_ID) LEFT JOIN
         decanet.mainprog USING (MAINPROG_ID) LEFT JOIN
         decanet.MPROGSUBJ USING (MAINPROG_ID) LEFT JOIN
         decanet.DSESSION USING(DSESSION_ID)
  WHERE SUBJ_ID = 45 AND SEMESTR = 1 AND CONTROL_ID = 3 AND RESULT_ID IN (5,6);

END $$


-- модификация с 0.006 до 0.007
DROP PROCEDURE IF EXISTS decanet.DCVERS_0006_0007 $$
CREATE PROCEDURE decanet.DCVERS_0006_0007()
BEGIN
  UPDATE decanet.school
    SET SCHOOL_DEPT = 'Федеральное агентство по образованию Российской Федерации';

  -- ГОСтандарты
  -- группа стандартов
  CREATE TABLE decanet.gosgroup (GOSGROUP_ID INT NOT NULL AUTO_INCREMENT,
                                 CONSTRAINT PK_GOSGROUP PRIMARY KEY (GOSGROUP_ID),
                                 GOSGROUP_CODE VARCHAR(25) NOT NULL,
                                 GOSGROUP_NAME VARCHAR(255) NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOSGROUP', 'gosgroup') THEN
    CREATE UNIQUE INDEX UIDX_GOSGROUP ON decanet.gosgroup(GOSGROUP_CODE);
  END IF;

  -- заполняем группы ГОС-стандартов
  INSERT INTO gosgroup (GOSGROUP_CODE, GOSGROUP_NAME)
     VALUES ('010000','ФИЗИКО-МАТЕМАТИЧЕСКИЕ НАУКИ'),
            ('011000','МЕХАНИКА. ПРИКЛАДНАЯ МАТЕМАТИКА'),
            ('020000','ЕСТЕСТВЕННЫЕ НАУКИ'),
            ('030000','ГУМАНИТАРНЫЕ НАУКИ'),
            ('031000','ФИЛОЛОГИЯ'),
            ('032000','ДОКУМЕНТОВЕДЕНИЕ'),
            ('040000','СОЦИАЛЬНЫЕ НАУКИ'),
            ('050000','ОБРАЗОВАНИЕ И ПЕДАГОГИКА'),
            ('060000','ЗДРАВООХРАНЕНИЕ'),
            ('070000','КУЛЬТУРА И ИСКУССТВО'),
            ('071000','ЛИТЕРАТУРНОЕ ТВОРЧЕСТВО'),
            ('080000','ЭКОНОМИКА И УПРАВЛЕНИЕ'),
            ('090000','ИНФОРМАЦИОННАЯ БЕЗОПАСНОСТЬ'),
            ('100000','СФЕРА ОБСЛУЖИВАНИЯ'),
            ('110000','СЕЛЬСКОЕ И РЫБНОЕ ХОЗЯЙСТВО'),
            ('111000','РЫБОЛОВСТВО'),
            ('120000','ГЕОДЕЗИЯ И ЗЕМЛЕУСТРОЙСТВО'),
            ('130000','ГЕОЛОГИЯ, РАЗВЕДКА И РАЗРАБОТКА ПОЛЕЗНЫХ ИСКОПАЕМЫХ'),
            ('140000','ЭНЕРГЕТИКА, ЭНЕРГЕТИЧЕСКОЕ МАШИНОСТРОЕНИЕ И ЭЛЕКТРОТЕХНИКА'),
            ('150000','МЕТАЛЛУРГИЯ, МАШИНОСТРОЕНИЕ И МАТЕРИАЛООБРАБОТКА'),
            ('151000','КОНСТРУКТОРСКО-ТЕХНОЛОГИЧЕСКОЕ ОБЕСПЕЧЕНИЕ АВТОМАТИЗИРОВАННЫХ МАШИНОСТРОИТЕЛЬНЫХ ПРОИЗВОДСТВ'),
            ('160000','АВИАЦИОННАЯ И РАКЕТНО-КОСМИЧЕСКАЯ ТЕХНИКА'),
            ('170000','ОРУЖИЕ И СИСТЕМЫ ВООРУЖЕНИЯ'),
            ('180000','МОРСКАЯ ТЕХНИКА'),
            ('190000','ТРАНСПОРТНЫЕ СРЕДСТВА'),
            ('200000','ПРИБОРОСТРОЕНИЕ И ОПТОТЕХНИКА'),
            ('210000','ЭЛЕКТРОННАЯ ТЕХНИКА, РАДИОТЕХНИКА И СВЯЗЬ'),
            ('220000','АВТОМАТИКА И УПРАВЛЕНИЕ'),
            ('230000','ИНФОРМАТИКА И ВЫЧИСЛИТЕЛЬНАЯ ТЕХНИКА'),
            ('240000','ХИМИЧЕСКАЯ И БИОТЕХНОЛОГИИ'),
            ('250000','ВОСПРОИЗВОДСТВО И ПЕРЕРАБОТКА ЛЕСНЫХ РЕСУРСОВ'), -- !!!
            ('260000','ТЕХНОЛОГИЯ ПРОДОВОЛЬСТВЕННЫХ ПРОДУКТОВ И ПОТРЕБИТЕЛЬСКИХ ТОВАРОВ'),
            ('261000','ТЕХНОЛОГИЯ ХУДОЖЕСТВЕННОЙ ОБРАБОТКИ МАТЕРИАЛОВ'),
            ('270000','СТРОИТЕЛЬСТВО И АРХИТЕКТУРА'),
            ('280000','БЕЗОПАСНОСТЬ ЖИЗНЕДЕЯТЕЛЬНОСТИ, ПРИРОДООБУСТРОЙСТВО И ЗАЩИТА ОКРУЖАЮЩЕЙ СРЕДЫ');

  -- направления обучения ГОС
  CREATE TABLE decanet.gosdir (GOSDIR_ID INT NOT NULL AUTO_INCREMENT,
                               CONSTRAINT PK_GOSDIR PRIMARY KEY (GOSDIR_ID),
                               GOSGROUP_ID INT NOT NULL,
                               CONSTRAINT FK_GOSDIR_GOSGROUP FOREIGN KEY (GOSGROUP_ID) REFERENCES gosgroup(GOSGROUP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                               GOSDIR_CODE VARCHAR(25) NOT NULL,
                               GOSDIR_NAME VARCHAR(255) NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOSDIR', 'gosdir') THEN
    CREATE UNIQUE INDEX UIDX_GOSDIR ON decanet.gosdir(GOSDIR_CODE);
  END IF;

  SET @GGRP120 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '120000');
  SET @GGRP250 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '250000');

  -- заполняем направления ГОС-стандартов
  INSERT INTO decanet.gosdir (GOSDIR_ID, GOSGROUP_ID, GOSDIR_CODE, GOSDIR_NAME)
    VALUES (1, @GGRP120, '120300', 'Землеустройство и кадастры'),
           (2, @GGRP250, '250100', 'Лесное дело'),
           (3, @GGRP250, '250200', 'Лесное хозяйство и ландщафтное строительство');

  -- стандарты
  CREATE TABLE decanet.gostitle (GOSTITLE_ID INT NOT NULL AUTO_INCREMENT,
                                 CONSTRAINT PK_GOSTITLE PRIMARY KEY (GOSTITLE_ID),
                                 GOSDIR_ID INT NOT NULL,
                                 CONSTRAINT FK_GOSTITLE_GOSDIR FOREIGN KEY (GOSDIR_ID) REFERENCES gosdir(GOSDIR_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                                 GOSTITLE_CODE VARCHAR(10) NOT NULL,
                                 GOSTITLE_NAME VARCHAR(255) NOT NULL,
                                 GOSTITLE_DOC VARCHAR(255)
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOSTITLE', 'gostitle') THEN
    CREATE UNIQUE INDEX UIDX_GOSTITLE ON decanet.gostitle(GOSTITLE_CODE);
  END IF;

  INSERT INTO decanet.gostitle (GOSTITLE_ID, GOSDIR_ID, GOSTITLE_CODE, GOSTITLE_NAME)
    VALUES (1, 1, '120302', 'Земельный кадастр'),
           (2, 2, '250100', 'Лесное дело'),
           (3, 3, '250201', 'Лесное хозяйство'),
           (4, 3, '250203', 'Садово-парковое и ландщафтное строительство');

  -- компоненты стандартов (федеральный, региональный и пр.)
  CREATE TABLE decanet.goscomp (GOSCOMP_ID INT NOT NULL AUTO_INCREMENT,
                                CONSTRAINT PK_GOSCOMP PRIMARY KEY (GOSCOMP_ID),
                                GOSCOMP_CODE VARCHAR(25),
                                GOSCOMP_NAME VARCHAR(255) NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOSCOMP', 'goscomp') THEN
    CREATE UNIQUE INDEX UIDX_GOSCOMP ON decanet.goscomp(GOSCOMP_CODE);
  END IF;

  INSERT INTO decanet.goscomp (GOSCOMP_ID, GOSCOMP_CODE, GOSCOMP_NAME)
    VALUES (1, 'ФК', 'Федеральный компонент'),
           (2, 'НРК', 'Национально-региональный (вузовский) компонент');

  -- циклы дисциплин стандартов
  CREATE TABLE decanet.goscycle (GOSCYCLE_ID INT NOT NULL AUTO_INCREMENT,
                                 CONSTRAINT PK_GOSCYCLE PRIMARY KEY (GOSCYCLE_ID),
                                 GOSCYCLE_CODE VARCHAR(25) NOT NULL,
                                 GOSCYCLE_NAME VARCHAR(255) NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOSCYCLE', 'goscycle') THEN
    CREATE UNIQUE INDEX UIDX_GOSCYCLE ON decanet.goscycle(GOSCYCLE_CODE);
  END IF;

  INSERT INTO decanet.goscycle (GOSCYCLE_ID, GOSCYCLE_CODE, GOSCYCLE_NAME)
    VALUES (1, 'ГСЭ.00', 'Общие гуманитаpные и социально-экономические дисциплины'),
           (2, 'ЕН.00', 'Математические и общие естественнонаучные дисциплины'),
           (3, 'ОПД.00', 'Общепpофессиональные дисциплины'),
           (4, 'СД.00', 'Специальные дисциплины'),
           (5, 'Ф0.00', 'Факультативы'),
           (6, 'П.00', 'Практика'),
           (7, 'ГЭК.00', 'Итоговая государственная аттестация'),
           (8, 'ДИП.00', 'Дипломное проектирование и защита дипломного проекта');

  -- состав стандарта
  CREATE TABLE decanet.gos (GOS_ID INT NOT NULL AUTO_INCREMENT,
                            CONSTRAINT PK_GOS PRIMARY KEY (GOS_ID),
                            GOSTITLE_ID INT NOT NULL,
                            CONSTRAINT FK_GOS_GOSTITLE FOREIGN KEY (GOSTITLE_ID) REFERENCES gostitle(GOSTITLE_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                            GOSCOMP_ID INT NOT NULL,
                            CONSTRAINT FK_GOS_GOSCOMP FOREIGN KEY (GOSCOMP_ID) REFERENCES goscomp(GOSCOMP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                            GOSCYCLE_ID INT NOT NULL,
                            CONSTRAINT FK_GOS_GOSCYCLE FOREIGN KEY (GOSCYCLE_ID) REFERENCES goscycle(GOSCYCLE_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                            GOS_CODE VARCHAR(25) NOT NULL,
                            GOS_NAME VARCHAR(255) NOT NULL,
                            GOS_VOL INT NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GOS', 'gos') THEN
    CREATE UNIQUE INDEX UIDX_GOS ON decanet.gos(GOSTITLE_ID, GOS_CODE);
  END IF;

  INSERT INTO decanet.gos (GOSTITLE_ID, GOSCOMP_ID, GOSCYCLE_ID, GOS_CODE, GOS_NAME, GOS_VOL)
           -- 1 - 120302 - Земельный кадастр
    VALUES (1, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (1, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (1, 1, 1, 'ГСЭ.Ф.03', 'История человечества', 0),
           (1, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (1, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (1, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (1, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (1, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (1, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (1, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (1, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (1, 2, 1, 'ГСЭ.Ф.12', 'Национально-региональный (вузовский) компонент', 270),
           (1, 2, 1, 'ГСЭ.Ф.13', 'Курсы по выбору студента, устанавливаемые вузом', 270),
           (1, 1, 2, 'EH.01', 'Высшая математика с основами математической статистики', 400),
           (1, 1, 2, 'EH.02', 'Информатика', 200),
           (1, 1, 2, 'EH.03', 'Физика', 300),
           (1, 1, 2, 'EH.04', 'Химия', 100),
           (1, 1, 2, 'EH.05', 'Общая биология с основами экологии', 100),
           (1, 1, 2, 'EH.06', 'Геодезия', 500),
           (1, 1, 2, 'EH.07', 'Почвоведение', 150),
           (1, 2, 2, 'EH.08', 'Курсы по выбору студента, устанавливаемые вузом (факультетом)', 200),
           (1, 1, 3, 'ОД.01', 'Мелиорации земель', 200),
           (1, 1, 3, 'ОД.02', 'Инженерное оборудование территории', 80),
           (1, 1, 3, 'ОД.03', 'Основы технологии   сельскохозяйственного  производства', 120),
           (1, 1, 3, 'ОД.04', 'Фотограмметрия и дешифрирование снимков', 220),
           (1, 1, 3, 'ОД.05', 'Картография и топографическое черчение', 120),
           (1, 1, 3, 'ОД.06', 'Экономико-математические методы и модели', 150),
           (1, 1, 3, 'ОД.07', 'Аграрная экономика и организация сельскохозяйственных предприятий', 200),
           (1, 1, 3, 'ОД.08', 'Безопасность жизнедеятельности', 100),
           (1, 2, 3, 'ОД.09', 'Курсы по выбору студента, устанавливаемые вузом (факультетом)', 150),
           (1, 1, 4, 'СД.01', 'Мониторинг земель', 80),
           (1, 1, 4, 'СД.02', 'Землеустроительное проектирование', 300),
           (1, 1, 4, 'СД.03', 'Прогнозирование и планирование использования земельных ресурсов', 100),
           (1, 1, 4, 'СД.04', 'Организация землеустроительных и земельнокадастровых работ', 80),
           (1, 1, 4, 'СД.05', 'Земельное право', 200),
           (1, 1, 4, 'СД.06', 'Кадастр застроенных территорий и планировка сельских населенных мест', 100),
           (1, 1, 4, 'СД.07', 'Государственный контроль за использованием земельных ресурсов', 80),
           (1, 1, 4, 'СД.08', 'Земельный кадастр', 440),
           (1, 1, 4, 'СД.09', 'Государственное регулирование земельных отношений', 90),
           (1, 2, 4, 'СД.10', 'Курсы по выбору студента, устанавливаемые вузом (факультетом)', 100),
           (1, 2, 4, 'ДС.00', 'Дисциплины специализаций, устанавливаемые вузом (факультетом)', 720),
           (1, 1, 5, 'Ф.00', 'Факультатив', 450),
           (1, 1, 5, 'Ф.01', 'Военная подготовка', 450),
           (1, 1, 6, 'П.01', 'Практика по геодезии', 432),
           (1, 1, 6, 'П.02', 'Практика по почвоведению', 54),
           (1, 1, 6, 'П.03', 'Практика по прикладной геодезии', 108),
           (1, 1, 6, 'П.04', 'Практика по фотограмметрии и дешифрированию снимков', 108),
           (1, 1, 6, 'П.05', 'Практика по экологии', 108),
           (1, 1, 6, 'П.06', 'Практика по информатике', 54),
           (1, 1, 6, 'П.07', 'Практика по землеустройству, геодезии и др. работам', 432),
           (1, 1, 6, 'П.08', 'Практика по земельному кадастру', 972),
           (1, 1, 7, 'ГЭК.01', 'Итоговая государственная аттестация - Госэкзамен', 108),
           (1, 1, 8, 'ДИП.01', 'Дипломное проектирование и защита дипломного проекта', 756),
           -- 2 - 250100 - Лесное дело
           (2, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (2, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (2, 1, 1, 'ГСЭ.Ф.03', 'История человечества', 0),
           (2, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (2, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (2, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (2, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (2, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (2, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (2, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (2, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (2, 2, 1, 'ГСЭ.Ф.12', 'Национально-региональный (вузовский) компонент', 270),
           (2, 2, 1, 'ГСЭ.Ф.13', 'Курсы по выбору студента, устанавливаемые вузом', 270),
           (2, 1, 2, 'ЕН.Ф.01.1', 'Высшая математика', 190),
           (2, 1, 2, 'ЕН.Ф.01.2', 'Системный анализ и моделирование экосистем', 170),
           (2, 1, 2, 'ЕН.Ф.02', 'Информатика', 150),
           (2, 1, 2, 'ЕН.Ф.03', 'Физика', 190),
           (2, 1, 2, 'ЕН.Ф.04', 'Химия', 200),
           (2, 1, 2, 'ЕН.Ф.05', 'Экология и охрана природы', 150),
           (2, 1, 2, 'ЕН.Ф.06.01', 'Морфология и систематика растений', 130),
           (2, 1, 2, 'ЕН.Ф.06.02', 'Анатомия растений', 85),
           (2, 1, 2, 'ЕН.Ф.06.03', 'Физиология растений с основами биохимии', 130),
           (2, 1, 2, 'ЕН.Ф.06.04', 'Генетика', 85),
           (2, 1, 2, 'ЕН.Ф.06.05', 'Лесная фитопатология', 110),
           (2, 1, 2, 'ЕН.Ф.06.06', 'Лесная энтомология', 110),
           (2, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 250),
           (2, 2, 2, 'ЕН.В.00', 'Дисциплины  по выбору студента, устанавливаемые вузом', 110),
           (2, 1, 3, 'ОПД.Ф.01', 'Почвоведение с основами геологии', 200),
           (2, 1, 3, 'ОПД.Ф.02', 'Дендpология', 140),
           (2, 1, 3, 'ОПД.Ф.03', 'Лесоведение', 140),
           (2, 1, 3, 'ОПД.Ф.04', 'Начертательная геометрия и инженеpная гpафика', 70),
           (2, 1, 3, 'ОПД.Ф.05', 'Геодезия', 120),
           (2, 1, 3, 'ОПД.Ф.06', 'Таксация леса', 160),
           (2, 1, 3, 'ОПД.Ф.07', 'Лесная метеоpология', 70),
           (2, 1, 3, 'ОПД.Ф.08', 'Безопасность жизнедеятельности', 100),
           (2, 1, 3, 'ОПД.Ф.09', 'Тракторы и автомобили с основами технической механики', 70),
           (2, 1, 3, 'ОПД.Ф.10', 'Гидpотехнические мелиорации лесных земель', 110),
           (2, 1, 3, 'ОПД.Ф.11', 'Мониторинг лесных земель', 100),
           (2, 2, 3, 'ОПД.Р.00', 'Национально-региональный (вузовский) компонент', 120),
           (2, 2, 3, 'ОПД.В.00', 'Дисциплины  по выбоpу студента, устанавливаемые вузом', 150),
           (2, 2, 4, 'СД.00', 'Специальные дисциплины', 1160),
           (2, 2, 5, 'ФТД.00', 'Факультативы', 450),
           (2, 2, 5, 'ФТД.01', 'Военная подготовка', 450),
           -- 3 - 250201 Лесное хозяйство
           (3, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (3, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (3, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (3, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (3, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (3, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (3, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (3, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (3, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (3, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (3, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (3, 2, 1, 'ГСЭ.Ф.12', 'Национально-региональный (вузовский) компонент', 270),
           (3, 2, 1, 'ГСЭ.Ф.13', 'Курсы по выбору студента, устанавливаемые вузом', 270),
           (3, 1, 2, 'ЕН.Ф.01', 'Математика', 360),
           (3, 1, 2, 'ЕН.Ф.02', 'Информатика', 130),
           (3, 1, 2, 'ЕН.Ф.03', 'Физика', 190),
           (3, 1, 2, 'ЕН.Ф.04', 'Химия', 218),
           (3, 1, 2, 'ЕН.Ф.05', 'Экология', 150),
           (3, 1, 2, 'ЕН.Ф.06.01', 'Ботаника', 150),
           (3, 1, 2, 'ЕН.Ф.06.02', 'Дендрология', 170),
           (3, 1, 2, 'ЕН.Ф.06.03', 'Физиология растений', 140),
           (3, 1, 2, 'ЕН.Ф.06.04', 'Генетика', 100),
           (3, 1, 2, 'ЕН.Ф.06.05', 'Почвоведение', 200),
           (3, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 120),
           (3, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 120),
           (3, 1, 3, 'ОПД.Ф.01', 'Начертательная геометрия . Инженерная графика', 90),
           (3, 1, 3, 'ОПД.Ф.02', 'Геодезия', 130),
           (3, 1, 3, 'ОПД.Ф.03', 'Метеорология и климатология', 60),
           (3, 1, 3, 'ОПД.Ф.04', 'Гидротехнические мелиорации', 124),
           (3, 1, 3, 'ОПД.Ф.05', 'Таксация', 160),
           (3, 1, 3, 'ОПД.Ф.06', 'Экономика отрасли', 120),
           (3, 1, 3, 'ОПД.Ф.07', 'Организация и планирование', 130),
           (3, 1, 3, 'ОПД.Ф.08', 'Лесомелиорация ландшафтов', 100),
           (3, 1, 3, 'ОПД.Ф.09', 'Основы лесопаркового хозяйства', 80),
           (3, 1, 3, 'ОПД.Ф.10', 'Защита  растений', 210),
           (3, 1, 3, 'ОПД.Ф.10.01', 'Фитопаталогия', 105),
           (3, 1, 3, 'ОПД.Ф.10.02', 'Энтомология', 105),
           (3, 1, 3, 'ОПД.Ф.11', 'Биология зверей и птиц', 80),
           (3, 1, 3, 'ОПД.Ф.12', 'Селекция  растений', 100),
           (3, 1, 3, 'ОПД.Ф.13', 'Аэрокосмические методы в лесном хозяйстве и ландшафтном строительстве', 90),
           (3, 1, 3, 'ОПД.Ф.14', 'Машины и механизмы', 100),
           (3, 1, 3, 'ОПД.Ф.15', 'Безопасность жизнедеятельности', 100),
           (3, 2, 3, 'ОПД.Р.00', 'Национально-региональный компонент', 130),
           (3, 2, 3, 'ОПД.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 128),
           (3, 1, 4, 'СД.01.01', 'Лесоведение', 100),
           (3, 1, 4, 'СД.01.02', 'Лесоводство', 150),
           (3, 1, 4, 'СД.02', 'Лесные культуры', 210),
           (3, 1, 4, 'СД.03', 'Лесоустройство', 170),
           (3, 1, 4, 'СД.04', 'Лесное товароведение с основами древесиноведения', 100),
           (3, 1, 4, 'СД.05', 'Основы сельскохозяйственных пользований', 80),
           (3, 1, 4, 'СД.06.01', 'Тракторы и автомобили с основами технической механики', 100),
           (3, 1, 4, 'СД.06.02', 'Система машин в лесном хозяйстве', 150),
           (3, 1, 4, 'СД.07', 'Недревесная продукция леса', 140),
           (3, 1, 4, 'СД.08.01', 'Технология и оборудование лесозаготовок', 100),
           (3, 1, 4, 'СД.08.02', 'Транспорт леса', 50),
           (3, 1, 4, 'СД.09', 'Информационные технологии в лесном хозяйстве', 100),
           (3, 1, 4, 'ДС.10', 'Дисциплины специализаций', 582),
           (3, 1, 5, 'Ф.00', 'Факультативы', 450),
           (3, 1, 5, 'Ф.01', 'Военная подготовка', 450),
           -- 4 - 250203 Садово-парковое и ландшафтное строительство
           (4, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (4, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (4, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (4, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (4, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (4, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (4, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (4, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (4, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (4, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (4, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (4, 2, 1, 'ГСЭ.Ф.12', 'Национально-региональный (вузовский) компонент', 270),
           (4, 2, 1, 'ГСЭ.Ф.13', 'Курсы по выбору студента, устанавливаемые вузом', 270),
           (4, 1, 2, 'ЕН.Ф.01', 'Математика', 360),
           (4, 1, 2, 'ЕН.Ф.02', 'Информатика', 130),
           (4, 1, 2, 'ЕН.Ф.03', 'Физика', 190),
           (4, 1, 2, 'ЕН.Ф.04', 'Химия', 218),
           (4, 1, 2, 'ЕН.Ф.05', 'Экология', 150),
           (4, 1, 2, 'ЕН.Ф.06.01', 'Ботаника', 150),
           (4, 1, 2, 'ЕН.Ф.06.02', 'Дендрология', 170),
           (4, 1, 2, 'ЕН.Ф.06.03', 'Физиология растений', 140),
           (4, 1, 2, 'ЕН.Ф.06.04', 'Генетика', 100),
           (4, 1, 2, 'ЕН.Ф.06.05', 'Почвоведение', 200),
           (4, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 120),
           (4, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 120),
           (4, 1, 3, 'ОПД.Ф.01', 'Начертательная геометрия . Инженерная графика', 90),
           (4, 1, 3, 'ОПД.Ф.02', 'Геодезия', 130),
           (4, 1, 3, 'ОПД.Ф.03', 'Метеорология и климатология', 60),
           (4, 1, 3, 'ОПД.Ф.04', 'Гидротехнические мелиорации', 124),
           (4, 1, 3, 'ОПД.Ф.05', 'Таксация', 160),
           (4, 1, 3, 'ОПД.Ф.06', 'Экономика отрасли', 120),
           (4, 1, 3, 'ОПД.Ф.07', 'Организация и планирование', 130),
           (4, 1, 3, 'ОПД.Ф.08', 'Лесомелиорация ландшафтов', 100),
           (4, 1, 3, 'ОПД.Ф.09', 'Основы лесопаркового хозяйства', 80),
           (4, 1, 3, 'ОПД.Ф.10', 'Защита  растений', 210),
           (4, 1, 3, 'ОПД.Ф.10.01', 'Фитопаталогия', 105),
           (4, 1, 3, 'ОПД.Ф.10.02', 'Энтомология', 105),
           (4, 1, 3, 'ОПД.Ф.11', 'Биология зверей и птиц', 80),
           (4, 1, 3, 'ОПД.Ф.12', 'Селекция  растений', 100),
           (4, 1, 3, 'ОПД.Ф.13', 'Аэрокосмические методы в лесном хозяйстве и ландшафтном строительстве', 90),
           (4, 1, 3, 'ОПД.Ф.14', 'Машины и механизмы', 100),
           (4, 1, 3, 'ОПД.Ф.15', 'Безопасность жизнедеятельности', 100),
           (4, 2, 3, 'ОПД.Р.00', 'Национально-региональный компонент', 130),
           (4, 2, 3, 'ОПД.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 128),
           (4, 1, 4, 'СД.01.01', 'Цветоводство', 150),
           (4, 1, 4, 'СД.01.02', 'Древоводство', 110),
           (4, 1, 4, 'СД.02', 'Архитектурная графика и основы композиции', 140),
           (4, 1, 4, 'СД.03', 'Ландшафтоведение', 110),
           (4, 1, 4, 'СД.04', 'Градостроительство с основами архитектуры', 120),
           (4, 1, 4, 'СД.05', 'Садово-парковое искусство (история)', 100),
           (4, 1, 4, 'СД.06', 'Ландшафтная архитектура (современные проблемы)', 90),
           (4, 1, 4, 'СД.07', 'Ландшафтное проектирование', 260),
           (4, 1, 4, 'СД.08', 'Стpоительство и эксплуатация объектов ландшафтного строительства', 130),
           (4, 1, 4, 'СД.09', 'Информационные технологии в ландшафтном проектировании', 100),
           (4, 1, 4, 'СД.10', 'Урбоэкология и мониторинг', 70),
           (4, 1, 4, 'ДС.11', 'Дисциплины специализаций', 652),
           (4, 1, 5, 'Ф.00', 'Факультативы', 450),
           (4, 1, 5, 'Ф.01', 'Военная подготовка', 450);



  -- адаптированный к факультету состав дисциплин в разделе стандарта
  CREATE TABLE decanet.gsubj (GSUBJ_ID INT NOT NULL AUTO_INCREMENT,
                              CONSTRAINT PK_GSUBJ PRIMARY KEY (GSUBJ_ID),
                              FACULTET_ID INT NOT NULL,
                              CONSTRAINT FK_GSUBJ_FACULTET FOREIGN KEY (FACULTET_ID) REFERENCES facultet(FACULTET_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                              GOS_ID INT NOT NULL,
                              CONSTRAINT FK_GSUBJ_GOS FOREIGN KEY (GOS_ID) REFERENCES gos(GOS_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                              SUBJ_ID INT NOT NULL,
                              CONSTRAINT FK_GSUBJ_SUBJ FOREIGN KEY (SUBJ_ID) REFERENCES subj(SUBJ_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                              GSUBJ_CODE VARCHAR(25) NOT NULL
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_GSUBJ', 'gsubj') THEN
    CREATE UNIQUE INDEX UIDX_GSUBJ ON decanet.gsubj(FACULTET_ID, GOS_ID, SUBJ_ID);
  END IF;

  -- удаляем старый механизм специальностей
  ALTER TABLE decanet.division DROP FOREIGN KEY FK_DIVISION_DIRECTION;
  ALTER TABLE decanet.division DROP COLUMN DIRECTION_ID;
  ALTER TABLE decanet.division DROP FOREIGN KEY FK_DIVISION_SPECIALITY;
  ALTER TABLE decanet.division DROP COLUMN SPECIALITY_ID;

  ALTER TABLE decanet.subspec DROP FOREIGN KEY FK_SUBSPEC_SPECIALITY;
  ALTER TABLE decanet.subspec DROP COLUMN SPECIALITY_ID;
  ALTER TABLE decanet.subspec ADD COLUMN GOSTITLE_ID INT NOT NULL AFTER SUBSPEC_ID;
  ALTER TABLE decanet.subspec ADD CONSTRAINT FK_SUBSPEC_GOSTITLE FOREIGN KEY (GOSTITLE_ID) REFERENCES gostitle(GOSTITLE_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  DROP TABLE decanet.speciality;
  DROP TABLE decanet.direction;

  -- назначение отделениям стандарта
  ALTER TABLE decanet.division ADD COLUMN GOSTITLE_ID INT NOT NULL AFTER FACULTET_ID;
  UPDATE decanet.division
    SET GOSTITLE_ID = 1
    WHERE DIVISION_ID = 7;
  UPDATE decanet.division
    SET GOSTITLE_ID = 2
    WHERE DIVISION_ID = 3;
  UPDATE decanet.division
    SET GOSTITLE_ID = 3
    WHERE DIVISION_ID IN (1, 2, 8);
  UPDATE decanet.division
    SET GOSTITLE_ID = 4
    WHERE DIVISION_ID IN (4, 5, 6, 9);
  ALTER TABLE decanet.division ADD CONSTRAINT FK_DIVISION_GOSTITLE FOREIGN KEY (GOSTITLE_ID) REFERENCES gostitle(GOSTITLE_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  -- здесь адаптируем подсистему к операциям восстановить / перевести
  -- mainprog
  ALTER TABLE decanet.mainprog ADD COLUMN MAINPROG_HIDFLAG BOOL NOT NULL DEFAULT FALSE AFTER VOLUME;
  ALTER TABLE decanet.mainprog DROP COLUMN VOLUMEDOC;

  -- persprog - чистим дубли
  CREATE TABLE decanet.wrk_persprog AS
    SELECT MIN(P.PERSPROG_ID) AS PERSPROG_ID, P.student_ID, D.SEMESTR, J.SUBJ_ID, M.CONTROL_ID, P.VOLUME
      FROM decanet.persprog P LEFT JOIN
           decanet.mainprog M USING (MAINPROG_ID) LEFT JOIN
           decanet.mprogsubj J USING (MPROGSUBJ_ID) LEFT JOIN
           decanet.dsession D USING (DSESSION_ID)
      GROUP BY P.student_ID, D.SEMESTR, J.SUBJ_ID, M.CONTROL_ID;

  CREATE UNIQUE INDEX UIDX_WRK_PERSPROG ON decanet.wrk_persprog(PERSPROG_ID);

  SET FOREIGN_KEY_CHECKS = 0;

  DELETE decanet.persprog
    FROM decanet.persprog LEFT JOIN
         decanet.wrk_persprog USING (PERSPROG_ID)
    WHERE PERSPROG_ID IS NULL;

  DROP TABLE wrk_persprog;

  DELETE decanet.acad
    FROM decanet.acad LEFT JOIN
         decanet.persprog USING (PERSPROG_ID)
    WHERE PERSPROG_ID IS NULL;

  DELETE decanet.progdoc
    FROM decanet.progdoc LEFT JOIN
         decanet.persprog USING (PERSPROG_ID)
    WHERE PERSPROG_ID IS NULL;

  DELETE decanet.persname
    FROM decanet.persname LEFT JOIN
         decanet.persprog USING (PERSPROG_ID)
    WHERE PERSPROG_ID IS NULL;

  SET FOREIGN_KEY_CHECKS = 1;

  -- заплатка
  DELETE FROM decanet.persprog WHERE PERSPROG_ID = 357166;

  -- перезачет оценок ранее восстановленных студентов
  UPDATE decanet.student S LEFT JOIN
         decanet.sgroup G USING (SGROUP_ID) LEFT JOIN
         decanet.stream R USING (STREAM_ID) LEFT JOIN
         decanet.dsession E USING (STREAM_ID) LEFT JOIN
         decanet.mainprog M USING (DSESSION_ID) LEFT JOIN
         decanet.mprogsubj J USING (MAINPROG_ID) LEFT JOIN
         decanet.persprog P USING (STUDENT_ID) LEFT JOIN
         decanet.mprogsubj Q ON Q.MPROGSUBJ_ID = P.MPROGSUBJ_ID LEFT JOIN
         decanet.mainprog N ON N.mainprog_ID = P.mainprog_ID LEFT JOIN
         decanet.dsession I ON I.DSESSION_ID = N.DSESSION_ID
    SET P.mainprog_ID = IFNULL(M.mainprog_ID, P.mainprog_ID)
    WHERE E.DSESSION_ID <> I.DSESSION_ID AND
          Q.SUBJ_ID = J.SUBJ_ID AND
          N.CONTROL_ID = M.CONTROL_ID AND
          E.SEMESTR = I.SEMESTR;

  -- студенты - группы
  CREATE TABLE decanet.studsgrp (STUDSGRP_ID INT NOT NULL AUTO_INCREMENT,
                                 CONSTRAINT PK_STUDSGRP PRIMARY KEY (STUDSGRP_ID),
                                 -- для уникальности обучения на отделении
                                 DIVISION_ID INT NOT NULL,
                                 CONSTRAINT FK_STUDSGRP_DIVISION FOREIGN KEY (DIVISION_ID) REFERENCES division(DIVISION_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                                 SGROUP_ID INT NOT NULL,
                                 CONSTRAINT FK_STUDSGRP_SGROUP FOREIGN KEY (SGROUP_ID) REFERENCES sgroup(SGROUP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                                 STUDENT_ID INT NOT NULL,
                                 CONSTRAINT FK_STUDSGRP_STUDENT FOREIGN KEY (STUDENT_ID) REFERENCES student(STUDENT_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                                 EDUFORM_ID INT NOT NULL,
                                 CONSTRAINT FK_STUDSGRP_EDUFORM FOREIGN KEY (EDUFORM_ID) REFERENCES eduform(EDUFORM_ID) ON DELETE NO ACTION ON UPDATE NO ACTION
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_STUDSGRP', 'studsgrp') THEN
    CREATE UNIQUE INDEX UIDX_STUDSGRP ON decanet.studsgrp(DIVISION_ID, STUDENT_ID);
  END IF;

  -- !!! ДЛЯ ОТЛАДКИ ИНТЕРФЕЙСА - ПОТОМ УБРАТЬ !!!
  --  ALTER TABLE decanet.studsgrp AUTO_INCREMENT = 100000;

  INSERT INTO decanet.studsgrp (STUDSGRP_ID, DIVISION_ID, SGROUP_ID, STUDENT_ID, EDUFORM_ID)
    SELECT NULL, R.DIVISION_ID, S.SGROUP_ID, S.student_ID, S.EDUFORM_ID
      FROM decanet.student S LEFT JOIN
           decanet.sgroup G USING (SGROUP_ID) LEFT JOIN
           decanet.stream R USING (STREAM_ID);

  ALTER TABLE decanet.student DROP FOREIGN KEY FK_STUDENT_SGROUP;
  ALTER TABLE decanet.student DROP COLUMN SGROUP_ID;
  ALTER TABLE decanet.student DROP FOREIGN KEY FK_STUDENT_EDUFORM;
  ALTER TABLE decanet.student DROP COLUMN EDUFORM_ID;

  ALTER TABLE decanet.persprog DROP COLUMN VOLUMEDOC;
  ALTER TABLE decanet.persprog ADD COLUMN STUDSGRP_ID INT NOT NULL AFTER PERSPROG_ID;
  UPDATE decanet.persprog P LEFT JOIN
         decanet.studsgrp SG USING (STUDENT_ID)
      SET P.STUDSGRP_ID = SG.STUDSGRP_ID;
  ALTER TABLE decanet.persprog ADD CONSTRAINT FK_PERSPROG_STUDSGRP FOREIGN KEY (STUDSGRP_ID) REFERENCES studsgrp(STUDSGRP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  ALTER TABLE decanet.persprog DROP FOREIGN KEY FK_PERSPROG_STUDENT;
  ALTER TABLE decanet.persprog DROP INDEX IDX_PPKEY;
  ALTER TABLE decanet.persprog DROP FOREIGN KEY FK_PERSPROG_MAINPROG;
  ALTER TABLE decanet.persprog DROP INDEX UIDX_PERSPROG;
  ALTER TABLE decanet.persprog DROP COLUMN STUDENT_ID;
  CREATE UNIQUE INDEX UIDX_PERSPROG ON decanet.persprog(MAINPROG_ID, STUDSGRP_ID);
  CREATE INDEX IDX_PPKEY ON decanet.persprog(MPROGSUBJ_ID, STUDSGRP_ID);
  ALTER TABLE decanet.persprog ADD CONSTRAINT FK_PERSPROG_MAINPROG FOREIGN KEY (MAINPROG_ID) REFERENCES mainprog(MAINPROG_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  ALTER TABLE decanet.contingent ADD COLUMN STUDSGRP_ID INT NOT NULL AFTER CONTINGENT_ID;
  UPDATE decanet.contingent C LEFT JOIN
         decanet.studsgrp SG USING (STUDENT_ID)
      SET C.STUDSGRP_ID = SG.STUDSGRP_ID;
  ALTER TABLE decanet.contingent ADD CONSTRAINT FK_CONTINGENT_STUDSGRP FOREIGN KEY (STUDSGRP_ID) REFERENCES studsgrp(STUDSGRP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  ALTER TABLE decanet.contingent DROP FOREIGN KEY FK_CONTINGENT_STUDENT;
  ALTER TABLE decanet.contingent DROP INDEX UIDX_CONTINGENT;
  ALTER TABLE decanet.contingent DROP COLUMN STUDENT_ID;
  CREATE UNIQUE INDEX UIDX_CONTINGENT ON decanet.contingent(STUDSGRP_ID, STUDSTATUS_ID, DOCUMENT_ID);

  ALTER TABLE decanet.studdoc ADD COLUMN STUDSGRP_ID INT NOT NULL AFTER STUDDOC_ID;
  UPDATE decanet.studdoc D LEFT JOIN
         decanet.studsgrp SG USING (STUDENT_ID)
      SET D.STUDSGRP_ID = SG.STUDSGRP_ID;
  ALTER TABLE decanet.studdoc ADD CONSTRAINT FK_STUDDOC_STUDSGRP FOREIGN KEY (STUDSGRP_ID) REFERENCES studsgrp(STUDSGRP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

  ALTER TABLE decanet.studdoc DROP FOREIGN KEY FK_STUDDOC_STUDENT;
  ALTER TABLE decanet.studdoc DROP INDEX UIDX_STUDDOC;
  ALTER TABLE decanet.studdoc DROP COLUMN STUDENT_ID;
  CREATE UNIQUE INDEX UIDX_STUDDOC ON decanet.studdoc(STUDSGRP_ID, DOCUMENT_ID);

  -- продления на STUDSGRP_ID
  ALTER TABLE decanet.prolong ADD COLUMN STUDSGRP_ID INT NOT NULL AFTER STUDENT_ID;
  UPDATE decanet.prolong P LEFT JOIN
         decanet.studsgrp SG USING (STUDENT_ID)
      SET P.STUDSGRP_ID = SG.STUDSGRP_ID;
  ALTER TABLE decanet.prolong DROP FOREIGN KEY FK_PROLONG_STUDENT;
  ALTER TABLE decanet.prolong DROP FOREIGN KEY FK_PROLONG_PROLTYPE;
  ALTER TABLE decanet.prolong DROP FOREIGN KEY FK_PROLONG_DSESSION;
  ALTER TABLE decanet.prolong DROP INDEX UIDX_PROLONG;
  ALTER TABLE decanet.prolong DROP COLUMN STUDENT_ID;
  ALTER TABLE decanet.prolong ADD CONSTRAINT FK_PROLONG_STUDSGRP FOREIGN KEY (STUDSGRP_ID) REFERENCES studsgrp(STUDSGRP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;
  ALTER TABLE decanet.prolong ADD CONSTRAINT FK_PROLONG_PROLTYPE FOREIGN KEY (PROLTYPE_ID) REFERENCES proltype(PROLTYPE_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;
  ALTER TABLE decanet.prolong ADD CONSTRAINT FK_PROLONG_DSESSION FOREIGN KEY (DSESSION_ID) REFERENCES dsession(DSESSION_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;
  CREATE UNIQUE INDEX UIDX_PROLONG ON decanet.prolong(DSESSION_ID, STUDSGRP_ID);

END $$

-- модификация с 0.007 до 0.008
DROP PROCEDURE IF EXISTS decanet.DCVERS_0007_0008 $$
CREATE PROCEDURE decanet.DCVERS_0007_0008()
BEGIN

  -- причесываем группы в садово-парковом...
  UPDATE decanet.studsgrp
    SET SGROUP_ID = 101
    WHERE SGROUP_ID IN (106, 61);

  UPDATE decanet.studsgrp
    SET SGROUP_ID = 60
    WHERE SGROUP_ID = 104;

  DELETE
    FROM decanet.sgroup
    WHERE SGROUP_ID IN (61, 106, 104);

  ALTER TABLE decanet.school DROP COLUMN SCHOOL_BOSSFIO;
  ALTER TABLE decanet.facultet DROP COLUMN FACULTET_BOSSFIO;

END $$

-- модификация с 0.008 до 0.009
DROP PROCEDURE IF EXISTS decanet.DCVERS_0008_0009 $$
CREATE PROCEDURE decanet.DCVERS_0008_0009()
BEGIN

  -- синхронизация P.MPROGSUBJ_ID - из за ошибки автоперезачета
  UPDATE decanet.persprog P LEFT JOIN
         decanet.mprogsubj J USING (MPROGSUBJ_ID) LEFT JOIN
         decanet.mainprog M ON M.mainprog_ID = P.mainprog_ID LEFT JOIN
         decanet.mprogsubj Q ON Q.mainprog_ID = M.mainprog_ID
  SET P.MPROGSUBJ_ID = Q.MPROGSUBJ_ID
  WHERE Q.SUBJ_ID = J.SUBJ_ID AND
        P.mainprog_ID <> J.mainprog_ID;


  -- централизация физкультуры
  UPDATE decanet.mprogsubj
    SET SUBJ_ID = 205
    WHERE SUBJ_ID = 165;

  UPDATE decanet.gsubj
    SET SUBJ_ID = 205
    WHERE SUBJ_ID = 165;

  DELETE FROM decanet.subj
    WHERE SUBJ_ID = 165;

  -- лог таблица
  CREATE TABLE decanet.syslog (SYSLOG_ID INT NOT NULL AUTO_INCREMENT,
                               CONSTRAINT PK_SYSLOG PRIMARY KEY (SYSLOG_ID),
                               SYSLOG_TIMESTAMP TIMESTAMP NOT NULL,
                               DUSER_ID INT NOT NULL,
                               CONSTRAINT FK_SYSLOG_DUSER FOREIGN KEY (DUSER_ID) REFERENCES duser(DUSER_ID) ON DELETE NO ACTION ON UPDATE NO ACTION,
                               SYSLOG_IP INT NOT NULL,
                               SYSLOG_STATEMENT VARCHAR(255) NOT NULL,
                               SYSLOG_ERRNO INT NOT NULL,
                               SYSLOG_ERRDESC VARCHAR(255)
  ) /*!ENGINE=INNODB*/;

  -- профилактика дубликатов оценок (тройки)
  DELETE decanet.acad
    FROM (SELECT A.ACAD_ID, A.PERSPROG_ID, A.document_ID, X.CNT
            FROM (SELECT MAX(ACAD_ID) AS ACAD_ID, COUNT(ACAD_ID) AS CNT
                    FROM ACAD
                    WHERE RESULT_ID = 3
                    GROUP BY PERSPROG_ID HAVING COUNT(ACAD_ID) > 1) X LEFT JOIN
                 decanet.acad A USING (ACAD_ID)) Y LEFT JOIN
         decanet.acad USING (ACAD_ID);

  -- профилактика дубликатов оценок (зачтено)
  DELETE decanet.acad
    FROM (SELECT A.ACAD_ID, A.PERSPROG_ID, A.document_ID, X.CNT
            FROM (SELECT MAX(ACAD_ID) AS ACAD_ID, COUNT(ACAD_ID) AS CNT
                    FROM ACAD
                    WHERE RESULT_ID = 5
                    GROUP BY PERSPROG_ID HAVING COUNT(ACAD_ID) > 1) X LEFT JOIN
                 decanet.acad A USING (ACAD_ID)) Y LEFT JOIN
         decanet.acad USING (ACAD_ID);

END $$

-- модификация с 0.009 до 0.010
DROP PROCEDURE IF EXISTS decanet.DCVERS_0009_0010 $$
CREATE PROCEDURE decanet.DCVERS_0009_0010()
BEGIN
  -- Тюменский Юридический институт
  -- ГОСтандарты
  SET @GGRP020 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '020000');
  SET @GGRP030 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '030000');

  -- заполняем направления ГОС-стандартов
  INSERT INTO decanet.gosdir (GOSDIR_ID, GOSGROUP_ID, GOSDIR_CODE, GOSDIR_NAME)
    VALUES (4, @GGRP020, '021100', 'Юриспруденция'),
           (5, @GGRP030, '030500', 'Правоохранительная деятельность');

  INSERT INTO decanet.gostitle (GOSTITLE_ID, GOSDIR_ID, GOSTITLE_CODE, GOSTITLE_NAME)
    VALUES (5, 4, '021100', 'Юриспруденция'),
           (6, 5, '030505', 'Правоохранительная деятельность');

  INSERT INTO decanet.gos (GOSTITLE_ID, GOSCOMP_ID, GOSCYCLE_ID, GOS_CODE, GOS_NAME, GOS_VOL)
    VALUES  -- 5 - 021100 Юриспруденция
           (5, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (5, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (5, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (5, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (5, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (5, 1, 1, 'ГСЭ.Ф.06', 'Логика', 0),
           (5, 1, 1, 'ГСЭ.Ф.07', 'Русский язык и культура речи', 0),
           (5, 1, 1, 'ГСЭ.Ф.08', 'Социология', 0),
           (5, 1, 1, 'ГСЭ.Ф.09', 'Философия', 0),
           (5, 1, 1, 'ГСЭ.Ф.10', 'Экономика', 0),
           (5, 2, 1, 'ГСЭ.Н.-Р.00', 'Национально-региональный (вузовский) компонент', 270),
           (5, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (5, 1, 2, 'ЕН.Ф.01', 'Концепции современного естествознания', 0),
           (5, 1, 2, 'ЕН.Ф.02', 'Информатика и математика', 0),
           (5, 2, 2, 'ЕН.Н.-Р.00', 'Национально-региональный (вузовский) компонент', 40),
           (5, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 40),
           (5, 1, 3, 'ОПД.Ф.01', 'Теория государства и права', 240),
           (5, 1, 3, 'ОПД.Ф.02', 'История политических и правовых учений', 90),
           (5, 1, 3, 'ОПД.Ф.03', 'История отечественного государства и права', 250),
           (5, 1, 3, 'ОПД.Ф.04', 'История государства и права зарубежных стран', 250),
           (5, 1, 3, 'ОПД.Ф.05', 'Конституционное (государственное) право России', 240),
           (5, 1, 3, 'ОПД.Ф.06', 'Конституционное (государственное) право зарубежных стран', 144),
           (5, 1, 3, 'ОПД.Ф.07', 'Гражданское право', 684),
           (5, 1, 3, 'ОПД.Ф.08', 'Гражданское процессуальное право (гражданский процесс)', 240),
           (5, 1, 3, 'ОПД.Ф.09', 'Административное право', 188),
           (5, 1, 3, 'ОПД.Ф.10', 'Трудовое право', 216),
           (5, 1, 3, 'ОПД.Ф.11', 'Уголовное право', 378),
           (5, 1, 3, 'ОПД.Ф.12', 'Уголовно-процессуальное право (уголовный процесс)', 240),
           (5, 1, 3, 'ОПД.Ф.13', 'Криминалистика', 188),
           (5, 1, 3, 'ОПД.Ф.14', 'Международное право', 132),
           (5, 1, 3, 'ОПД.Ф.15', 'Экологическое право', 132),
           (5, 1, 3, 'ОПД.Ф.16', 'Земельное право', 116),
           (5, 1, 3, 'ОПД.Ф.17', 'Римское право', 100),
           (5, 1, 3, 'ОПД.Ф.18', 'Международное частное право', 144),
           (5, 1, 3, 'ОПД.Ф.19', 'Финансовое право', 144),
           (5, 1, 3, 'ОПД.Ф.20', 'Муниципальное право России', 132),
           (5, 1, 3, 'ОПД.Ф.21', 'Семейное право', 132),
           (5, 1, 3, 'ОПД.Ф.22', 'Криминология', 144),
           (5, 1, 3, 'ОПД.Ф.23', 'Правоохранительные органы', 108),
           (5, 1, 3, 'ОПД.Ф.24', 'Юридическая психология', 112),
           (5, 2, 3, 'ОПД.Н.-Р.01', 'Уголовно-исполнительное право', 0),
           (5, 2, 3, 'ОПД.Н.-Р.02', 'Прокурорский надзор', 0),
           (5, 2, 3, 'ОПД.Н.-Р.03', 'Российское предпринимательское право', 0),
           (5, 2, 3, 'ОПД.Н.-Р.04', 'Коммерческое право', 0),
           (5, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 660),
           (5, 1, 4, 'Д.С.00', 'Дисциплины специализаций', 1620),
           (5, 1, 5, 'ФТД.00', 'Факультативы', 450),
           -- 6 - 030505 Правоохранительная деятельность
           (6, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (6, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (6, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (6, 1, 1, 'ГСЭ.Ф.04', 'Философия', 0),
           (6, 1, 1, 'ГСЭ.Ф.05', 'Экономика', 0),
           (6, 1, 1, 'ГСЭ.Ф.06', 'Социология', 0),
           (6, 1, 1, 'ГСЭ.Ф.07', 'Русский язык и культура речи', 0),
           (6, 1, 1, 'ГСЭ.Ф.08', 'Культурология', 0),
           (6, 1, 1, 'ГСЭ.Ф.09', 'Политология', 0),
           (6, 1, 1, 'ГСЭ.Ф.10', 'Психология и педагогика', 0),
           (6, 2, 1, 'ГСЭ.Н.-Р.00', 'Национально-региональный (вузовский) компонент', 522),
           (6, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 140),
           (6, 1, 2, 'ЕН.Ф.01', 'Концепции современного естествознания', 80),
           (6, 1, 2, 'ЕН.Ф.02', 'Математика и информатика', 240),
           (6, 2, 2, 'ЕН.Н.-Р.00', 'Национально-региональный (вузовский) компонент', 40),
           (6, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 40),
           (6, 1, 3, 'ОПД.Ф.01', 'Теория государства и права', 240),
           (6, 1, 3, 'ОПД.Ф.02', 'История отечественного государства и права', 132),
           (6, 1, 3, 'ОПД.Ф.03', 'История государства и права зарубежных стран', 128),
           (6, 1, 3, 'ОПД.Ф.04', 'Конституционное право России', 200),
           (6, 1, 3, 'ОПД.Ф.05', 'Конституционное право зарубежных стран ', 100),
           (6, 1, 3, 'ОПД.Ф.06', 'Административное право России', 200),
           (6, 1, 3, 'ОПД.Ф.07', 'Правоохранительные органы и правоохранительная деятельность', 160),
           (6, 1, 3, 'ОПД.Ф.08', 'Муниципальное право России', 60),
           (6, 1, 3, 'ОПД.Ф.09', 'Международное право', 80),
           (6, 1, 3, 'ОПД.Ф.10', 'Гражданское право', 360),
           (6, 1, 3, 'ОПД.Ф.11', 'Гражданский процесс', 80),
           (6, 1, 3, 'ОПД.Ф.12', 'Экологическое право', 80),
           (6, 1, 3, 'ОПД.Ф.13', 'Трудовое право', 100),
           (6, 1, 3, 'ОПД.Ф.14', 'Финансовое право', 80),
           (6, 1, 3, 'ОПД.Ф.15', 'Семейное право', 60),
           (6, 1, 3, 'ОПД.Ф.16', 'Уголовное право', 560),
           (6, 1, 3, 'ОПД.Ф.17', 'Уголовный процесс', 400),
           (6, 1, 3, 'ОПД.Ф.18', 'Криминалистика', 460),
           (6, 1, 3, 'ОПД.Ф.19', 'Криминология', 160),
           (6, 1, 3, 'ОПД.Ф.20', 'Уголовно-исполнительное право', 60),
           (6, 2, 3, 'ОПД.Н.-Р.00', 'Национально-региональный (вузовский) компонент', 380),
           (6, 2, 3, 'ОПД.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 244),
           (6, 1, 4, 'СД.01', 'Обеспечение прав человека в деятельности правоохранительных органов', 60),
           (6, 1, 4, 'СД.02', 'Тактико-специальная подготовка', 290),
           (6, 1, 4, 'СД.03', 'Огневая подготовка', 230),
           (6, 1, 4, 'СД.04', 'Специальная техника', 160),
           (6, 1, 4, 'СД.05', 'Государственная служба в правоохранительных органах', 60),
           (6, 1, 4, 'СД.06', 'Судебная медицина и судебная психиатрия', 120),
           (6, 1, 4, 'СД.07', 'Предупреждение преступлений и административных правонарушений правоохранительными органами', 100),
           (6, 1, 4, 'СД.08', 'Психология в деятельности сотрудников правоохранительных органов', 120),
           (6, 1, 4, 'СД.09', 'Дисциплины специализаций', 1282),
           (6, 1, 5, 'ФТД.00', 'Факультативы', 450);

  INSERT INTO decanet.perstatus(PERSTATUS_ID, PERSTATUS_NAME)
    VALUES(3, 'Начальник');

  INSERT INTO decanet.person(PERSON_ID, PERSTATUS_ID, PERSON_FNAME, PERSON_MNAME, PERSON_LNAME)
    VALUES(6, 3, 'Александр', 'Иванович', 'Числов'),
          (7, 2, '', '', 'Декан ФПС'),
          (8, 2, '', '', 'Декан ФПС КМ и МОБ');

  INSERT INTO decanet.school(SCHOOL_ID, CITY_ID, PERSON_ID, SCHOOL_DEPT, SCHOOL_ABBR, SCHOOL_NAME)
    VALUES (2, 65, 6, 'Министерство внутренних дел Российской Федерации', 'ГОУ ВПО <ТЮИ МВД России>', 'Государственное образовательное учреждение высшего профессионального образования <Тюменский юридический институт Министерства внутренних дел Российской Федерации>');

  INSERT INTO decanet.facultet(FACULTET_ID, SCHOOL_ID, EDUTYPE_ID, PERSON_ID, FACULTET_ABBR, FACULTET_NAME)
    VALUES(5, 2, 1, 7, 'ФПС', 'Факультет по подготовке следователей'),
          (6, 2, 1, 8, 'ФПС КМ и МОБ', 'Факультет по подготовке специалистов криминальной милиции и милиции общественной безопасности');

  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_ALGNO)
    VALUES (10, 5, 5, 3, NULL, '021100', '021100 Юриспруденция', 9, 2, 2),
           (11, 6, 6, 3, NULL, '030505', 'Правоохранительная деятельность', 9, 2, 2);

  -- справочник дисциплин
  ALTER TABLE decanet.subj DROP INDEX UIDX_SUBJC;
  ALTER TABLE decanet.subj DROP COLUMN SUBJ_CODE;
  DROP TABLE decanet.subregsub;
  DROP TABLE decanet.subreg;

  -- справочник фаз сессии
  ALTER TABLE decanet.sessphase ADD COLUMN SESSPHASE_HIDFLAG BOOL NOT NULL DEFAULT FALSE AFTER SESSPHASE_NAME;
  UPDATE decanet.sessphase
    SET SESSPHASE_HIDFLAG = TRUE
    WHERE SESSPHASE_ID = 1;

  -- справочник видов контроля
  INSERT INTO decanet.control (CONTROL_ID, CONTROL_ENDFLAG, CONTROL_ABBR, CONTROL_NAME, CONTROL_NAMED)
    VALUES (15, 0, 'РубКонтр', 'Рубежный контроль', 0);
  -- руб.контр. это пром. атт.
  INSERT INTO decanet.phasectrl (PHASECTRL_ID, SESSPHASE_ID, CONTROL_ID)
    VALUES (NULL, 1, 15);

  -- результаты рубежного контроля
  INSERT INTO decanet.resset (RESSET_ID, CONTROL_ID, RESULT_ID)
    VALUES (NULL, 15, 1),
           (NULL, 15, 2),
           (NULL, 15, 3),
           (NULL, 15, 4);
END $$

-- модификация с 0.010 до 0.011
DROP PROCEDURE IF EXISTS decanet.DCVERS_0010_0011 $$
CREATE PROCEDURE decanet.DCVERS_0010_0011()
BEGIN

  -- УГЛТУ ГФ
  -- ГОСтандарты
  SET @GGRP100 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '100000');
  SET @GGRP030 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '030000');

  -- заполняем направления ГОС-стандартов
  INSERT INTO decanet.gosdir (GOSDIR_ID, GOSGROUP_ID, GOSDIR_CODE, GOSDIR_NAME)
    VALUES (6, @GGRP100, '100103', 'Социально-культурный сервис и туризм'),
           (7, @GGRP030, '032103', 'Рекреация и спортивно-оздоровительный туризм');

  INSERT INTO decanet.gostitle (GOSTITLE_ID, GOSDIR_ID, GOSTITLE_CODE, GOSTITLE_NAME)
    VALUES (7, 6, '100103', 'Социально-культурный сервис и туризм'),
           (8, 7, '032103', 'Рекреация и спортивно-оздоровительный туризм');

  INSERT INTO decanet.gos (GOSTITLE_ID, GOSCOMP_ID, GOSCYCLE_ID, GOS_CODE, GOS_NAME, GOS_VOL)
    VALUES  -- 7 - 100103 (230500) Социально-культурный сервис и туризм
           (7, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (7, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (7, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (7, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (7, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (7, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (7, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (7, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (7, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (7, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (7, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (7, 2, 1, 'ГСЭ.Р.00', 'Национально-региональный (вузовский) компонент', 270),
           (7, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (7, 1, 2, 'ЕН.Ф.01', 'Математика и информатика', 270),
           (7, 1, 2, 'ЕН.Ф.02', 'Концепции современного естествознания', 130),
           (7, 1, 2, 'ЕН.Ф.03', 'Экология', 100),
           (7, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 50),
           (7, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 50),
           (7, 1, 3, 'ОПД.Ф.01', 'Человек и его потребности', 100),
           (7, 1, 3, 'ОПД.Ф.02', 'Сервисная деятельность', 100),
           (7, 1, 3, 'ОПД.Ф.03', 'Психодиагностика', 80),
           (7, 1, 3, 'ОПД.Ф.04', 'Психологический практикум', 100),
           (7, 1, 3, 'ОПД.Ф.05', 'Профессиональная этика и этикет', 120),
           (7, 1, 3, 'ОПД.Ф.06', 'Валеология', 100),
           (7, 1, 3, 'ОПД.Ф.07', 'Речевая коммуникация', 140),
           (7, 1, 3, 'ОПД.Ф.08', 'Иностранный язык (второй)', 460),
           (7, 1, 3, 'ОПД.Ф.09', 'Мировая культура и искусство', 140),
           (7, 1, 3, 'ОПД.Ф.10', 'Экономика и предпринимательство в социально-культурном сервисе и туризме', 120),
           (7, 1, 3, 'ОПД.Ф.11', 'Менеджмент в социально-культурном сервисе и туризме', 80),
           (7, 1, 3, 'ОПД.Ф.12', 'Маркетинг в социально-культурном сервисе и туризме', 80),
           (7, 1, 3, 'ОПД.Ф.13', 'Информационные технологии в социально-культурном сервисе и туризме. Оргтехника', 120),
           (7, 1, 3, 'ОПД.Ф.14', 'Методы научных исследований', 80),
           (7, 1, 3, 'ОПД.Ф.15', 'Стандартизация и сертификация социально-культурных и туристских услуг', 80),
           (7, 1, 3, 'ОПД.Ф.16', 'Безопасность жизнедеятельности', 100),
           (7, 2, 3, 'ОПД.Р.00', 'Национально-региональный (вузовский) компонент', 250),
           (7, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 250),
           (7, 1, 4, 'ДС.01.01', 'Техника и технология социально-культурного сервиса и туризма', 160),
           (7, 1, 4, 'ДС.01.02', 'Правовое обеспечение социально-культурного сервиса и туризма', 140),
           (7, 1, 4, 'ДС.01.03', 'Реклама в социально-культурном сервисе и туризме', 180),
           (7, 1, 4, 'ДС.01.04', 'Связь с общественностью (Паблик рилейшнз)', 140),
           (7, 1, 4, 'ДС.01.05', 'Документационное обеспечение управления социально-культурным сервисом и туризмом', 120),
           (7, 1, 4, 'ДС.01.06', 'Инновации в социально-культурном сервисе и туризме', 120),
           (7, 1, 4, 'ДС.02', 'Дисциплины специализации', 2052),
           (7, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (7, 1, 5, 'ФТД.01', 'Военная подготовка', 450),
           -- 8  032103 Рекреация и  спротивно-оздоровительный туризм
           (8, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (8, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (8, 1, 1, 'ГСЭ.Ф.03', 'Философия', 0),
           (8, 1, 1, 'ГСЭ.Ф.04', 'Экономика', 0),
           (8, 1, 1, 'ГСЭ.Ф.05', 'Отечественная история', 0),
           (8, 1, 1, 'ГСЭ.Ф.06', 'Культурология', 0),
           (8, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (8, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (8, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (8, 1, 1, 'ГСЭ.Ф.10', 'Правоведение', 0),
           (8, 1, 1, 'ГСЭ.Ф.11', 'Политология', 0),
           (8, 2, 1, 'ГСЭ.Р.00', 'Национально-региональный (вузовский) компонент', 270),
           (8, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (8, 1, 2, 'ЕН.Ф.01', 'Математика', 140),
           (8, 1, 2, 'ЕН.Ф.02', 'Информатика', 140),
           (8, 1, 2, 'ЕН.Ф.03', 'География рекреационных систем и туризма', 140),
           (8, 1, 2, 'ЕН.Ф.04', 'Общая экология', 120),
           (8, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 90),
           (8, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 90),
           (8, 1, 3, 'ОПД.Ф.01', 'Рекреалогия', 130),
           (8, 1, 3, 'ОПД.Ф.02', 'Курортология', 120),
           (8, 1, 3, 'ОПД.Ф.03', 'Физиология человека', 200),
           (8, 1, 3, 'ОПД.Ф.04', 'Анатомия и морфология человека', 180),
           (8, 1, 3, 'ОПД.Ф.05', 'Мониторинг физического состояния человека', 180),
           (8, 1, 3, 'ОПД.Ф.06', 'Теория и методика физической культуры', 230),
           (8, 1, 3, 'ОПД.Ф.07', 'Социальная психология', 160),
           (8, 1, 3, 'ОПД.Ф.08', 'Эргономическая биомеханика', 120),
           (8, 1, 3, 'ОПД.Ф.09', 'Экономика рекреации и туризма', 140),
           (8, 1, 3, 'ОПД.Ф.10', 'Правовые основы рекреации и туризма', 140),
           (8, 1, 3, 'ОПД.Ф.11', 'Сооружения в рекреации и туризме', 120),
           (8, 1, 3, 'ОПД.Ф.12', 'Безопасность в сфере рекреации и туризма', 120),
           (8, 1, 3, 'ОПД.Ф.13', 'Туринформатика с основами рекламы', 140),
           (8, 1, 3, 'ОПД.Ф.14', 'Видео-фото дело', 130),
           (8, 1, 3, 'ОПД.Ф.15', 'Массаж', 160),
           (8, 1, 3, 'ОПД.Ф.16', 'Базовые виды физкультурной рекреации', 560),
           (8, 2, 3, 'ОПД.Р.00', 'Национально-региональный (вузовский) компонент', 340),
           (8, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 340),
           (8, 1, 4, 'СД.01', 'Основы спортивно-оздоровительного туризма', 160),
           (8, 1, 4, 'СД.02', 'Теория и методика физической рекреации', 160),
           (8, 1, 4, 'СД.03', 'Основы менеджмента рекреации и туризма', 160),
           (8, 1, 4, 'СД.04', 'Физическая реабилитация', 190),
           (8, 1, 4, 'СД.05', 'Краеведение', 100),
           (8, 1, 4, 'СД.06', 'Маркетинг рекреации и туризма', 140),
           (8, 1, 4, 'СД.07', 'Теория и методика культурно-досуговой деятельности', 120),
           (8, 1, 4, 'СД.08', 'Иностранный язык - (профильный)', 200),
           (8, 1, 4, 'СД.09', 'Профессиональное мастерство', 800),
           (8, 2, 4, 'СД.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 360),
           (8, 1, 5, 'ФТД.', 'Цикл факультативных дисциплин', 450);

  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_ALGNO)
    VALUES (12, 3, 7, 3, NULL, '100103', '100103 Социально-культурный сервис и туризм', 9, 2, 2),
           (13, 3, 7, 3, NULL, '100103 Вечернее', 'Вечернее 100103 Социально-культурный сервис и туризм', 9, 2, 2),
           (14, 3, 8, 3, NULL, '032103', '032103 Рекреация и спортивно-оздоровительный туризм', 9, 2, 2);

END $$


-- модификация с 0.011 до 0.012
DROP PROCEDURE IF EXISTS decanet.DCVERS_0011_0012 $$
CREATE PROCEDURE decanet.DCVERS_0011_0012()
BEGIN
  -- Машков
  UPDATE decanet.persprog
    SET STUDSGRP_ID = 2556
    WHERE STUDSGRP_ID = 2046;

  CALL decanet.NEWMAINPROGSYNC(2556);

  -- имена групп на ГФ УГЛТУ
  UPDATE decanet.division
    SET DIVISION_ALGNO = 1
    WHERE FACULTET_ID = 3;


END $$

-- модификация с 0.012 до 0.013
DROP PROCEDURE IF EXISTS decanet.DCVERS_0012_0013 $$
CREATE PROCEDURE decanet.DCVERS_0012_0013()
BEGIN

  -- удалить пустые акадоки
  DELETE decanet.document
    FROM decanet.document LEFT JOIN
         decanet.progdoc USING (DOCUMENT_ID)
    WHERE DOCUMENT_ID IS NULL AND
          DOCTYPE_ID IN (1,2,6,8,12);

  -- развести сильнопересекающиеся экспортные номера акадоков
  CREATE TEMPORARY TABLE decanet.ttDOCNO AS
    SELECT DOCUMENT_NO
      FROM document
      WHERE DOCTYPE_ID IN (1,2,6,8,12)
      GROUP BY DOCUMENT_NO HAVING COUNT(DOCUMENT_NO) > 2;

  UPDATE decanet.ttDOCNO T LEFT JOIN
         decanet.document D USING (DOCUMENT_NO)
    SET D.document_NO = D.document_BARNO;

END $$

-- модификация с 0.013 до 0.014
DROP PROCEDURE IF EXISTS decanet.DCVERS_0013_0014 $$
CREATE PROCEDURE decanet.DCVERS_0013_0014()
BEGIN

  -- УрГЭУ МиМЭО
  INSERT INTO decanet.person(PERSON_ID, PERSTATUS_ID, PERSON_FNAME, PERSON_MNAME, PERSON_LNAME)
    VALUES(9, 3, 'Михаил', 'Васильевич', 'Федоров'),
          (10, 2, 'Лариса', 'Михайловна', 'Капустина');

  -- добавляем поле почтового индекса SCHOOL_POST в school
  ALTER TABLE decanet.school ADD COLUMN SCHOOL_POST VARCHAR(25) AFTER SCHOOL_NPUNKT;

  INSERT INTO decanet.school(SCHOOL_ID, CITY_ID, PERSON_ID, SCHOOL_DEPT, SCHOOL_ABBR, SCHOOL_NAME, SCHOOL_POST, SCHOOL_STREET, SCHOOL_BLDNO)
    VALUES (3, 18, 9, 'Федеральное агентство по образованию Российской Федерации', 'УрГЭУ', 'ГОУ ВПО Уральский государственный экономический  университет', '620219', '8 Марта', 62);

  INSERT INTO decanet.facultet(FACULTET_ID, SCHOOL_ID, EDUTYPE_ID, PERSON_ID, FACULTET_ABBR, FACULTET_NAME)
    VALUES(7, 3, 1, 10, 'МиМЭО', 'Менеджмента и международных экономических отношений');

  -- УрГЭУ МиМЭО
  -- ГОСтандарты
  SET @GGRP080 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '080000');
  SET @GGRP070 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '070000');

  -- заполняем направления ГОС-стандартов
  INSERT INTO decanet.gosdir (GOSDIR_ID, GOSGROUP_ID, GOSDIR_CODE, GOSDIR_NAME)
    VALUES (8,  @GGRP080, '080102', 'Мировая экономика'),
           (9,  @GGRP080, '080507', 'Менеджмент организации'),
           (10, @GGRP080, '080500', 'Менеджмент (бакалавриат)'),
           (11, @GGRP070, '070801', 'Реклама');

  INSERT INTO decanet.gostitle (GOSTITLE_ID, GOSDIR_ID, GOSTITLE_CODE, GOSTITLE_NAME)
    VALUES (9, 8,   '080102', 'Мировая экономика'),
           (10, 9,  '080507', 'Менеджмент организации'),
           (11, 10, '080500.62', 'Менеджмент (бакалавриат)'),
           (12, 11, '070801', 'Реклама');

  INSERT INTO decanet.gos (GOSTITLE_ID, GOSCOMP_ID, GOSCYCLE_ID, GOS_CODE, GOS_NAME, GOS_VOL)
    VALUES  -- 9 - (060600) 080102 Мировая экономика
           (9, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык (основной)', 340),
           (9, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (9, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (9, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (9, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (9, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (9, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (9, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (9, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (9, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (9, 1, 1, 'ГСЭ.Ф.11', 'Экономическая теория', 0),
           (9, 2, 1, 'ГСЭ.Р.00', 'Региональный (вузовский) компонент', 270),
           (9, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом (факультетом)', 270),
           (9, 1, 2, 'ЕН.Ф.01', 'Математика', 600),
           (9, 1, 2, 'ЕН.Ф.02', 'Информатика', 200),
           (9, 1, 2, 'ЕН.Ф.03', 'Информационные системы в экономике', 0),
           (9, 1, 2, 'ЕН.Ф.04', 'Эконометрика', 0),
           (9, 1, 2, 'ЕН.Ф.05', 'Концепции современного естествознания', 0),
           (9, 2, 2, 'ЕН.Р.00', 'Региональный (вузовский) компонент', 140),
           (9, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом (факультетом)', 140),
           (9, 1, 3, 'ОПД.Ф.01', 'Иностранный язык (профессиональный)', 1460),
           (9, 1, 3, 'ОПД.Ф.02', 'Экономика организаций (предприятий)', 0),
           (9, 1, 3, 'ОПД.Ф.03', 'Менеджмент', 0),
           (9, 1, 3, 'ОПД.Ф.04', 'Маркетинг', 0),
           (9, 1, 3, 'ОПД.Ф.05', 'Статистика', 0),
           (9, 2, 3, 'ОПД.Р.00', 'Региональный (вузовский) компонент', 340),
           (9, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом (факультетом)', 100),
           (9, 1, 4, 'СД.01', 'Мировая экономика', 0),
           (9, 1, 4, 'СД.02', 'Международные экономические отношения', 0),
           (9, 1, 4, 'СД.03', 'Международные валютно-кредитные отношения', 0),
           (9, 1, 4, 'СД.04', 'Бухгалтерский учёт', 0),
           (9, 1, 4, 'СД.05', 'Основы аудита', 0),
           (9, 1, 4, 'СД.06', 'Экономический анализ', 0),
           (9, 1, 4, 'СД.07', 'Финансы', 0),
           (9, 1, 4, 'СД.08', 'Деньги, кредит, банки', 0),
           (9, 1, 4, 'СД.09', 'Рынок ценных бумаг', 0),
           (9, 1, 4, 'СД.10', 'Налоги и налогообложение', 0),
           (9, 1, 4, 'СД.11', 'Страхование', 0),
           (9, 1, 4, 'СД.12', 'Правовое обеспечение экономики', 0),
           (9, 1, 4, 'СД.13', 'Дисциплины специализации', 800),
           (9, 2, 3, 'СД.Ф', 'Дисциплины по выбору студента, устанавливаемые вузом (факультетом)', 200),
           (9, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (9, 1, 5, 'ФТД.01', 'Военная подготовка', 450),

      -- 10 (061100) 080507 Менеджмент организации
           (10, 1, 1, 'ГСЭ.Ф.01', 'Философия', 0),
           (10, 1, 1, 'ГСЭ.Ф.02', 'Иностранный язык', 340),
           (10, 1, 1, 'ГСЭ.Ф.03', 'Культурология', 0),
           (10, 1, 1, 'ГСЭ.Ф.04', 'Отечественная история', 0),
           (10, 1, 1, 'ГСЭ.Ф.05', 'Правоведение', 0),
           (10, 1, 1, 'ГСЭ.Ф.06', 'Социология', 0),
           (10, 1, 1, 'ГСЭ.Ф.07', 'Политология', 0),
           (10, 1, 1, 'ГСЭ.Ф.08', 'Психология и педагогика', 0),
           (10, 1, 1, 'ГСЭ.Ф.09', 'Физическая культура', 408),
           (10, 1, 1, 'ГСЭ.Ф.10', 'Русский язык и культура речи', 0),
           (10, 2, 1, 'ГСЭ.Р.00', 'Региональный (вузовский) компонент', 270),
           (10, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (10, 1, 2, 'ЕН.Ф.01', 'Математика', 0),
           (10, 1, 2, 'ЕН.Ф.02', 'Информатика', 0),
           (10, 1, 2, 'ЕН.Ф.03', 'Концепции современного естествознания', 0),
           (10, 2, 2, 'ЕН.Р.00', 'Региональный (вузовский) компонент', 100),
           (10, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 100),
           (10, 1, 3, 'ОПД.Ф.01', 'Основы менеджмента', 250),
           (10, 1, 3, 'ОПД.Ф.02', 'Экономическая теория', 250),
           (10, 1, 3, 'ОПД.Ф.03', 'Маркетинг', 0),
           (10, 1, 3, 'ОПД.Ф.04', 'Теория организации', 0),
           (10, 1, 3, 'ОПД.Ф.05', 'Мировая экономика', 0),
           (10, 1, 3, 'ОПД.Ф.06', 'Финансы и кредит', 150),
           (10, 1, 3, 'ОПД.Ф.07', 'Статистика', 150),
           (10, 1, 3, 'ОПД.Ф.08', 'Бухгалтерский учёт', 150),
           (10, 1, 3, 'ОПД.Ф.09', 'Организационное поведение', 0),
           (10, 1, 3, 'ОПД.Ф.10', 'Хозяйственное право', 0),
           (10, 2, 3, 'ОПД.Р.00', 'Региональный (вузовский) компонент', 250),
           (10, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 250),
           (10, 1, 4, 'СД.01', 'Стратегический менеджмент', 0),
           (10, 1, 4, 'СД.02', 'Управленческие решения', 0),
           (10, 1, 4, 'СД.03', 'Информационные технологии управления', 0),
           (10, 1, 4, 'СД.04', 'Антикризисное управление', 0),
           (10, 1, 4, 'СД.05', 'Логистика', 0),
           (10, 1, 4, 'СД.06', 'Управление персоналом', 0),
           (10, 1, 4, 'СД.07', 'Инновационный менеджмент', 0),
           (10, 1, 4, 'СД.08', 'Исследование систем управления', 0),
           (10, 1, 4, 'СД.09', 'Управление качеством', 0),
           (10, 2, 4, 'СД.Р.00', 'Региональный (вузовский) компонент', 250),
           (10, 2, 3, 'СД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 250),
           (10, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (10, 1, 5, 'ФТД.01', 'Военная подготовка', 450),
      -- 11 (521500) 080500.62 Менеджмент (бакалавриат)
           (11, 1, 1, 'ГСЭ.Ф.01', 'Философия', 0),
           (11, 1, 1, 'ГСЭ.Ф.02', 'Иностранный язык', 340),
           (11, 1, 1, 'ГСЭ.Ф.03', 'Культурология', 0),
           (11, 1, 1, 'ГСЭ.Ф.04', 'Отечественная история', 0),
           (11, 1, 1, 'ГСЭ.Ф.05', 'Правоведение', 0),
           (11, 1, 1, 'ГСЭ.Ф.06', 'Социология', 0),
           (11, 1, 1, 'ГСЭ.Ф.07', 'Политология', 0),
           (11, 1, 1, 'ГСЭ.Ф.08', 'Психология и педагогика', 0),
           (11, 1, 1, 'ГСЭ.Ф.09', 'Физическая культура', 408),
           (11, 1, 1, 'ГСЭ.Ф.10', 'Русский язык и культура речи', 0),
           (11, 2, 1, 'ГСЭ.Р.00', 'Региональный (вузовский) компонент', 270),
           (11, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (11, 1, 2, 'ЕН.Ф.01', 'Математика', 0),
           (11, 1, 2, 'ЕН.Ф.02', 'Информатика', 0),
           (11, 1, 2, 'ЕН.Ф.03', 'Концепции современного естествознания', 0),
           (11, 2, 2, 'ЕН.Р.00', 'Региональный (вузовский) компонент', 100),
           (11, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 100),
           (11, 1, 3, 'ОПД.Ф.01', 'Основы менеджмента', 250),
           (11, 1, 3, 'ОПД.Ф.02', 'Экономическая теория', 250),
           (11, 1, 3, 'ОПД.Ф.03', 'Организационное поведение', 0),
           (11, 1, 3, 'ОПД.Ф.04', 'Теория организации', 200),
           (11, 1, 3, 'ОПД.Ф.05', 'Маркетинг', 200),
           (11, 1, 3, 'ОПД.Ф.06', 'Государственное и муниципальное управление', 150),
           (11, 2, 3, 'ОПД.Р.00', 'Региональный (вузовский) компонент', 250),
           (11, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 250),
           (11, 1, 4, 'СД.00', 'Специальные дисциплины', 1000),
           (11, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (11, 1, 5, 'ФТД.01', 'Военная подготовка', 450),
        -- 12 (350700) 070801 Реклама
           (12, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык', 340),
           (12, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (12, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (12, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (12, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (12, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (12, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (12, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (12, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (12, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (12, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 0),
           (12, 2, 1, 'ГСЭ.Р.00', 'Национально-региональный (вузовский) компонент', 270),
           (12, 2, 1, 'ГСЭ.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом', 270),
           (12, 1, 2, 'ЕН.Ф.01', 'Математика', 380),
           (12, 1, 2, 'ЕН.Ф.02', 'Концепции современного естествознания', 200),
           (12, 2, 2, 'ЕН.Р.00', 'Национально-региональный (вузовский) компонент', 60),
           (12, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, установленные вузом', 60),
           (12, 1, 3, 'ОПД.Ф.01', 'Искусство и литература', 0),
           (12, 1, 3, 'ОПД.Ф.02', 'Экономическая теория', 0),
           (12, 1, 3, 'ОПД.Ф.03', 'Статистика', 0),
           (12, 1, 3, 'ОПД.Ф.04', 'Финансы, денежное обращение и кредит', 0),
           (12, 1, 3, 'ОПД.Ф.05', 'Бухгалтерский учёт и аудит', 0),
           (12, 1, 3, 'ОПД.Ф.06', 'Правовое регулирование рекламной деятельности', 0),
           (12, 1, 3, 'ОПД.Ф.07', 'Менеджмент', 0),
           (12, 1, 3, 'ОПД.Ф.08', 'Маркетинг', 0),
           (12, 1, 3, 'ОПД.Ф.09', 'Коммерция', 0),
           (12, 1, 3, 'ОПД.Ф.10', 'Деловое общение', 0),
           (12, 1, 3, 'ОПД.Ф.11', 'Основы рекламы', 0),
           (12, 1, 3, 'ОПД.Ф.12', 'Паблик рилейшнз', 0),
           (12, 1, 3, 'ОПД.Ф.13', 'Психология рекламной деятельности', 0),
           (12, 1, 3, 'ОПД.Ф.14', 'Социология рекламной деятельности', 0),
           (12, 2, 3, 'ОПД.Р.00', 'Национально-региональный (вузовский) компонент', 330),
           (12, 2, 3, 'ОПД.В.00', 'Дисциплины по выбору студента, устанавливаемые вузом', 330),
           (12, 1, 4, 'ДС.01', 'Информационные технологии в рекламе', 0),
           (12, 1, 4, 'ДС.02', 'Массовые коммуникации и медиапланирование ', 0),
           (12, 1, 4, 'ДС.03', 'Разработка и технологии производства рекламного продукта', 0),
           (12, 2, 4, 'СД.Р.00', 'Национально-региональный (вузовский) компонент', 900),
           (12, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (12, 1, 5, 'ФТД.01', 'Военная подготовка', 450);

  -- добавляем специальное поле DIVISION_NPREFIX в division для формирования наименований групп
  ALTER TABLE decanet.division ADD COLUMN DIVISION_NPREFIX VARCHAR(25) AFTER DIVISION_HALFUYEAR;

  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_NPREFIX, DIVISION_ALGNO)
    VALUES (15, 7, 9,  3, NULL, '080102', '080102 Мировая экономика', 9, 2, 'МЭО', 3),
           (16, 7, 10, 3, NULL, '080507', '080507 Менеджмент организации', 9, 2, 'М', 3),
           (17, 7, 11, 3, NULL, '080500 бакалавры', '080500 Менеджмент (бакалавриат)', 9, 2, 'БМ', 3),
           (18, 7, 12, 3, NULL, '070801', '070801 Реклама', 9, 2, 'Р', 3);

END $$


-- модификация с 0.014 до 0.015
DROP PROCEDURE IF EXISTS decanet.DCVERS_0014_0015 $$
CREATE PROCEDURE decanet.DCVERS_0014_0015()
BEGIN
  -- лог
  -- DROP DATABASE IF EXISTS sitlog;
  CREATE DATABASE IF NOT EXISTS sitlog DEFAULT CHARACTER SET utf8;

  DROP TABLE IF EXISTS sitlog.dclog;
  CREATE TABLE sitlog.dclog (DCLOG_ID INT NOT NULL AUTO_INCREMENT,
                             CONSTRAINT PK_DCLOG PRIMARY KEY (DCLOG_ID),
                             DBUSER VARCHAR(50) NOT NULL,
                             DUSER_ID INT NOT NULL,
                             DCLOG_DT DATETIME NOT NULL,
                             DCLOG_EXPRESSION TINYTEXT NOT NULL,
                             DCLOG_IRESULT INT NOT NULL, -- код ошибки MySQL
                             DCLOG_SRESULT TINYTEXT,     -- ошибка MySQL
                             DCLOG_IRET INT              -- возврат СП
    ) ENGINE=INNODB;

  -- ГОС природопользование ЛХФ/УГЛГУ
  SET @GGRP020 = (SELECT GOSGROUP_ID FROM decanet.gosgroup WHERE GOSGROUP_CODE = '020000');

  -- заполняем направления ГОС-стандартов
  INSERT INTO decanet.gosdir (GOSDIR_ID, GOSGROUP_ID, GOSDIR_CODE, GOSDIR_NAME)
    VALUES (12,  @GGRP020, '020802', 'Природопользование');

  INSERT INTO decanet.gostitle (GOSTITLE_ID, GOSDIR_ID, GOSTITLE_CODE, GOSTITLE_NAME)
    VALUES (13, 12, '020802', 'Природопользование');

  INSERT INTO decanet.gos (GOSTITLE_ID, GOSCOMP_ID, GOSCYCLE_ID, GOS_CODE, GOS_NAME, GOS_VOL)
    VALUES  -- 13 - (020802) 013400 Природопользование
           (13, 1, 1, 'ГСЭ.Ф.01', 'Иностранный язык (основной)', 340),
           (13, 1, 1, 'ГСЭ.Ф.02', 'Физическая культура', 408),
           (13, 1, 1, 'ГСЭ.Ф.03', 'Отечественная история', 0),
           (13, 1, 1, 'ГСЭ.Ф.04', 'Культурология', 0),
           (13, 1, 1, 'ГСЭ.Ф.05', 'Политология', 0),
           (13, 1, 1, 'ГСЭ.Ф.06', 'Правоведение', 0),
           (13, 1, 1, 'ГСЭ.Ф.07', 'Психология и педагогика', 0),
           (13, 1, 1, 'ГСЭ.Ф.08', 'Русский язык и культура речи', 0),
           (13, 1, 1, 'ГСЭ.Ф.09', 'Социология', 0),
           (13, 1, 1, 'ГСЭ.Ф.10', 'Философия', 0),
           (13, 1, 1, 'ГСЭ.Ф.11', 'Экономика', 150),
           (13, 2, 1, 'ГСЭ.Р.00', 'Национально-региональный компонент, включая дисциплины и курсы по выбору студента, устанавливаемые вузом (факультетом)', 192),
           (13, 1, 2, 'ЕН.Ф.01', 'Математика', 350),
           (13, 1, 2, 'ЕН.Ф.02', 'Информатика', 200),
           (13, 1, 2, 'ЕН.Ф.03', 'Физика', 200),
           (13, 1, 2, 'ЕН.Ф.04', 'Химия', 250),
           (13, 1, 2, 'ЕН.Ф.05', 'Биология', 250),
           (13, 1, 2, 'ЕН.Ф.06', 'Геология', 100),
           (13, 1, 2, 'ЕН.Ф.07', 'География', 150),
           (13, 1, 2, 'ЕН.Ф.08', 'Почвоведение', 100),
           (13, 2, 2, 'ЕН.Р.00', 'Региональный компонент', 200),
           (13, 2, 2, 'ЕН.В.00', 'Дисциплины и курсы по выбору студента, устанавливаемые вузом (факультетом)', 100),
           (13, 1, 3, 'ОПД.Ф.01', 'Общая экология', 200),
           (13, 1, 3, 'ОПД.Ф.02', 'Основы природопользования', 200),
           (13, 1, 3, 'ОПД.Ф.03', 'Учение об атмосфере', 150),
           (13, 1, 3, 'ОПД.Ф.04', 'Учение о гидросфере', 150),
           (13, 1, 3, 'ОПД.Ф.05', 'Биогеография', 100),
           (13, 1, 3, 'ОПД.Ф.06', 'Ландшафтоведение', 100),
           (13, 1, 3, 'ОПД.Ф.07', 'Картография', 100),
           (13, 1, 3, 'ОПД.Ф.08', 'Социальная экология', 100),
           (13, 1, 3, 'ОПД.Ф.09', 'Экономика природопользования', 150),
           (13, 1, 3, 'ОПД.Ф.10', 'Правовые основы природопользования и охраны окружающей среды', 100),
           (13, 1, 3, 'ОПД.Ф.11', 'Техногенные системы и экологический риск', 150),
           (13, 1, 3, 'ОПД.Ф.12', 'География населения и геоурбанистика', 100),
           (13, 1, 3, 'ОПД.Ф.13', 'Ресурсоведение', 100),
           (13, 1, 3, 'ОПД.Ф.14', 'Региональное природопользование', 150),
           (13, 1, 3, 'ОПД.Ф.15', 'Геоинформационные системы', 100),
           (13, 1, 3, 'ОПД.Ф.16', 'Устойчивое развитие человечества', 100),
           (13, 1, 3, 'ОПД.Ф.17', 'Экологический мониторинг', 100),
           (13, 1, 3, 'ОПД.Ф.18', 'Экологическое проектирование и  экспертиза', 100),
           (13, 1, 3, 'ОПД.Ф.19', 'Экологический менеджмент', 100),
           (13, 1, 3, 'ОПД.Ф.20', 'Экологический аудит', 100),
           (13, 2, 3, 'ОПД.Р.00', 'Региональный компонент, включая дисциплины по выбору студента, устанавливаемые вузом', 800),
           (13, 1, 4, 'СД.00', 'Специальные дисциплины', 912),
           (13, 1, 5, 'ФТД.00', 'Факультативы', 450),
           (13, 1, 5, 'ФТД.01', 'Военная подготовка', 450),
           (13, 1, 5, 'ФТД.02', 'Цикл психолого-педагогических дисциплин', 450);


  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_NPREFIX, DIVISION_ALGNO)
    VALUES (19, 1, 13,  1, NULL, '020802', '020802 Природопользование', 9, 2, 'ПП', 1),
           (20, 1, 1,  1, NULL, '120302 (3 года)', '120302 Земельный кадастр (3 года)', 9, 2, 'ЗК3', 1);

END $$

-- модификация с 0.015 до 0.016
DROP PROCEDURE IF EXISTS decanet.DCVERS_0015_0016 $$
CREATE PROCEDURE decanet.DCVERS_0015_0016()
BEGIN
 DROP TABLE IF EXISTS decanet.ttSTUDRESCNT;

 -- ТЮИ
 UPDATE decanet.school
   SET SCHOOL_NAME = 'ГОУ ВПО "Тюменский юридический институт МВД России"'
   WHERE SCHOOL_ID = 2;

 UPDATE decanet.division
   SET DIVISION_ABBR = '030501.65',
       DIVISION_NAME = '030501.65 Юриспруденция'
   WHERE DIVISION_ID = 10;

 UPDATE decanet.division
   SET DIVISION_ABBR = '030505.65',
       DIVISION_NAME = '030505.65 Правоохранительная деятельность'
   WHERE DIVISION_ID = 11;

/*
  -- порядок в документах !!! СЛИТЬ С РАБОТЫ !!!
  UPDATE
    (SELECT *, COUNT(DOCUMENT_ID)
       FROM decanet.document
       GROUP BY DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO HAVING COUNT(DOCUMENT_ID) > 1) X LEFT JOIN
    decanet.document D USING (DOCUMENT_ID)
  SET D.document_NO = CONCAT(D.document_NO, '(1)');

  UPDATE
    (SELECT *, COUNT(DOCUMENT_ID)
       FROM decanet.document
       GROUP BY DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO HAVING COUNT(DOCUMENT_ID) > 1) X LEFT JOIN
    decanet.document D USING (DOCUMENT_ID)
  SET D.document_NO = CONCAT(D.document_NO, '(2)');
*/

  -- порядок в документах
  SET @n = 0;
  SET @d = '';

  DROP TEMPORARY TABLE IF EXISTS decanet.ttDOCNO;
  CREATE TEMPORARY TABLE decanet.ttDOCNO AS
  SELECT D.document_ID, IF(NOT (@d <=> D.document_NO), @n:= 0, NULL) AS A,
              IF(NOT (@d <=> D.document_NO), @d:= D.document_NO, NULL) AS B,
              CONCAT(TRIM(D.document_NO), ' (', @n:= @n + 1, ')') AS C
    FROM
      (SELECT DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO
         FROM decanet.document
         GROUP BY DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO
           HAVING COUNT(DOCUMENT_ID) > 1) X LEFT JOIN
      decanet.document D USING (DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO)
    ORDER BY DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO;


  UPDATE
    decanet.ttDOCNO T LEFT JOIN
    decanet.document D USING (DOCUMENT_ID)
    SET D.document_NO = T.C;


  IF NOT INDEXEXISTS('UIDX_DOCUMENT', 'document') THEN
    CREATE UNIQUE INDEX UIDX_DOCUMENT ON decanet.document(DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO);
  END IF;

  -- специализации ТЮИ
  INSERT INTO decanet.subspec(SUBSPEC_ID, GOSTITLE_ID, SUBSPEC_CODE, SUBSPEC_NAME)
    VALUES(NULL, 5, '030501.65', 'Уголовно-правовая');

  UPDATE decanet.division
    SET SUBSPEC_ID = Last_Insert_ID()
    WHERE DIVISION_ID = 10;

  INSERT INTO decanet.subspec(SUBSPEC_ID, GOSTITLE_ID, SUBSPEC_CODE, SUBSPEC_NAME)
    VALUES(NULL, 6, '030505.65', 'Уголовно-правовая');

  UPDATE decanet.division
    SET SUBSPEC_ID = Last_Insert_ID()
    WHERE DIVISION_ID = 11;

  -- реферат, практикум
  INSERT INTO decanet.control(CONTROL_ID, CONTROL_ENDFLAG, CONTROL_ABBR, CONTROL_NAME, CONTROL_NAMED)
    VALUES (16, 0, 'Реф', 'Реферат', 1),
           (17, 0, 'Пкум', 'Практикум', 1);

  INSERT INTO decanet.phasectrl(PHASECTRL_ID, SESSPHASE_ID, CONTROL_ID)
    VALUES (NULL, 2, 16),
           (NULL, 2, 17);

  -- группы видов контроля (для справки, карточки)
  CREATE TABLE decanet.ctrlgrp (CTRLGRP_ID INT NOT NULL AUTO_INCREMENT,
                                CONSTRAINT PK_CTRLGRP PRIMARY KEY (CTRLGRP_ID),
                                CTRLGRP_ABBR VARCHAR(25) NOT NULL,
                                CTRLGRP_NAME VARCHAR(255)
  ) /*!ENGINE=INNODB*/;

  IF NOT INDEXEXISTS('UIDX_CTRLGRP', 'ctrlgrp') THEN
    CREATE UNIQUE INDEX UIDX_CTRLGRP ON decanet.ctrlgrp(CTRLGRP_ABBR);
  END IF;

  INSERT INTO decanet.ctrlgrp(CTRLGRP_ID, CTRLGRP_ABBR, CTRLGRP_NAME)
    VALUES(1, 'ЗачЭкз', 'Зачёты и экзамены'),
          (2, 'Курс', 'Курсовые'),
          (3, 'Практ', 'Практики'),
          (4, 'Вып', 'Выпускные'),
          (5, 'Проч', 'Прочие');

  ALTER TABLE decanet.control ADD COLUMN CTRLGRP_ID INT NOT NULL AFTER CONTROL_ID;
  UPDATE decanet.control
    SET CTRLGRP_ID = CASE CONTROL_ID
                       WHEN 1 THEN 1
                       WHEN 2 THEN 1
                       WHEN 3 THEN 1
                       WHEN 4 THEN 2
                       WHEN 5 THEN 2
                       WHEN 6 THEN 3
                       WHEN 7 THEN 3
                       WHEN 8 THEN 3
                       WHEN 9 THEN 3
                       WHEN 10 THEN 5
                       WHEN 11 THEN 4
                       WHEN 12 THEN 4
                       WHEN 13 THEN 4
                       WHEN 14 THEN 5
                       WHEN 15 THEN 5
                       WHEN 16 THEN 5
                       WHEN 17 THEN 2
                     END;

  ALTER TABLE decanet.control ADD CONSTRAINT FK_CONTROL_CTRLGRP FOREIGN KEY (CTRLGRP_ID) REFERENCES ctrlgrp(CTRLGRP_ID) ON DELETE NO ACTION ON UPDATE NO ACTION;

END $$

-- модификация с 0.016 до 0.017
DROP PROCEDURE IF EXISTS decanet.DCVERS_0016_0017 $$
CREATE PROCEDURE decanet.DCVERS_0016_0017()
BEGIN
  DECLARE r INT DEFAULT 1;

  -- результаты реферат (CONTROL_ID = 16)
  INSERT INTO decanet.resset (RESSET_ID, CONTROL_ID, RESULT_ID)
    VALUES (NULL, 16, 1),
           (NULL, 16, 2),
           (NULL, 16, 3),
           (NULL, 16, 4),
  -- результаты практикум (CONTROL_ID = 17)
           (NULL, 17, 5),
           (NULL, 17, 6);

  -- рейтинг
  INSERT INTO decanet.control(CONTROL_ID, CTRLGRP_ID, CONTROL_ENDFLAG, CONTROL_ABBR, CONTROL_NAME, CONTROL_NAMED)
    VALUES (18, 5, 0, 'Рейт', 'Рейтинг %', 0);

  INSERT INTO decanet.phasectrl(PHASECTRL_ID, SESSPHASE_ID, CONTROL_ID)
    VALUES (NULL, 1, 18);

  WHILE r <= 100 DO
    -- процентные результаты
    INSERT INTO decanet.result(RESULT_ID, RESULT_INT, RESULT_ABBR, RESULT_NAME, RESULT_PASSFLAG)
      VALUES (r + 6, r, CONCAT(r, '%'), CONCAT(r, '%'), IF(r <= 50, 0, 1));

    -- результаты рейтинг (CONTROL_ID = 18)
    INSERT INTO decanet.resset (RESSET_ID, CONTROL_ID, RESULT_ID)
      VALUES (NULL, 18, r + 6);

    SET r = r + 1;
  END WHILE;

  -- дата до (например акад.отпуск)
  ALTER TABLE decanet.contingent ADD COLUMN CONTINGENT_TODATE DATE AFTER CONTINGENT_DATE;

END $$


-- модификация с 0.017 до 0.018
DROP PROCEDURE IF EXISTS decanet.DCVERS_0017_0018 $$
CREATE PROCEDURE decanet.DCVERS_0017_0018()
BEGIN

  -- пока с ГОСОM = 1
  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_NPREFIX, DIVISION_ALGNO)
    VALUES (21, 1, 1,  3, NULL, '120700.68 магистратура', '120700.68 Землеустройство и кадастры', 9, 2, '', 1),
           (22, 1, 1,  3, NULL, '120700.62 бакалавриат', '120700.62 Землеустройство и кадастры', 9, 2, '', 1),
           (23, 1, 1,  3, NULL, '120700.62 бакалавр (3 г)', '120700.62 Землеустройство и кадастры (3 года)', 9, 2, '', 1),
           (24, 1, 2,  3, NULL, '250100.68 магистратура', '250100.68 Лесное дело', 9, 2, '', 1),
           (25, 1, 2,  3, NULL, '022000.68 магистратура', '022000.68 Экология и природопользование', 9, 2, '', 1),
           (26, 1, 4,  3, NULL, '250700.68 магистратура', '250700.68 Ландшафтная архитектура', 9, 2, '', 1),
           (27, 1, 2,  3, NULL, '250100.62 бакалавр (3 г)', '250100.62 Лесное дело (3 года)', 9, 2, '', 1),
           (28, 1, 2,  3, NULL, '022000.62 бакалавриат', '022000.62 Экология и природопользование', 9, 2, '', 1),
           (29, 1, 4,  3, NULL, '250700.62 бакалавр (3 г)', '250700.62 Ландшафтная архитектура (3 года)', 9, 2, '', 1),
           (30, 1, 4,  3, NULL, '250700.62 бакалавриат', '250700.62 Ландшафтная архитектура', 9, 2, '', 1),
           (31, 1, 3,  3, NULL, '250201.65 охотоведение', '250201.65 Лесное хозяйство (охотоведение)', 9, 2, '', 1),
           (32, 1, 3,  3, NULL, '250100.62 бакалавр', '250100.62 Лесное дело', 9, 2, '', 1);

  -- ну и так далее (С) Шнур

END $$

-- модификация с 0.018 до 0.019
DROP PROCEDURE IF EXISTS decanet.DCVERS_0018_0019 $$
CREATE PROCEDURE decanet.DCVERS_0018_0019()
BEGIN


  -- переименование факультета ID = 1 в Институтом леса и природопользования ИЛП
  UPDATE decanet.facultet
    SET FACULTET_ABBR = 'ИЛП',
        FACULTET_NAME = 'Институт леса и природопользования'
    WHERE FACULTET_ID = 1;

  -- декан ЛХФ -> Директор ИЛП
  INSERT INTO decanet.perstatus(PERSTATUS_ID, PERSTATUS_NAME)
    VALUES(4, 'Директор');
  
  UPDATE decanet.person SET PERSTATUS_ID = 4 WHERE PERSON_ID = 2;

  -- уникальность номера документа - в течении года 
  ALTER TABLE decanet.document DROP INDEX UIDX_DOCUMENT;
  ALTER TABLE decanet.document ADD COLUMN DOCUMENT_PERIOD INT NOT NULL DEFAULT 0 AFTER DOCUMENT_EXPIRE;
  UPDATE decanet.document
    SET DOCUMENT_PERIOD = CAST(YEAR(DOCUMENT_OUTDATE) AS SIGNED);

  IF NOT INDEXEXISTS('UIDX_DOCUMENT', 'document') THEN
    CREATE UNIQUE INDEX UIDX_DOCUMENT ON decanet.document(DOCTYPE_ID, FACULTET_ID, DOCUMENT_NO, DOCUMENT_PERIOD);
  END IF;

--  CREATE TRIGGER ins_document BEFORE INSERT ON decanet.document
--   FOR EACH ROW
--     SET NEW.document_PERIOD := CAST(YEAR(NOW()) AS SIGNED);

  -- уникальность личного номера студента - в течении года
  ALTER TABLE decanet.student DROP INDEX UIDX_STUDENT;
  ALTER TABLE decanet.student ADD COLUMN STUDENT_PERIOD INT NOT NULL DEFAULT 0 AFTER STUDENT_PERSNO;
  UPDATE decanet.student S LEFT JOIN
         decanet.studsgrp SG USING (STUDENT_ID) LEFT JOIN
         decanet.sgroup G USING (SGROUP_ID) LEFT JOIN
         decanet.stream M USING (STREAM_ID)
    SET S.student_PERIOD = CAST(M.STREAM_FROMYEAR AS SIGNED);

  IF NOT INDEXEXISTS('UIDX_STUDENT', 'student') THEN
    CREATE UNIQUE INDEX UIDX_STUDENT ON decanet.student(STUDENT_PERSNO, STUDENT_PERIOD);
  END IF;

--  CREATE TRIGGER ins_student BEFORE INSERT ON decanet.student
--   FOR EACH ROW 
--     SET NEW.student_PERIOD := CAST(YEAR(NOW()) AS SIGNED);


  -- очередное добавление отделений
  -- опять пока с ГОСом = 1
  -- откуда взялся DIVISION_ID = 33 ???

  INSERT INTO decanet.division (DIVISION_ID, FACULTET_ID, GOSTITLE_ID, EDUTYPE_ID, SUBSPEC_ID, DIVISION_ABBR, DIVISION_NAME, DIVISION_UYEAR, DIVISION_HALFUYEAR, DIVISION_NPREFIX, DIVISION_ALGNO)
    VALUES (34, 1, 1,  3, NULL, '2501001.62', '2501001.62 Лесное хозяйство', 9, 2, '', 1),
           (35, 1, 1,  3, NULL, '2501003.62', '2501003.62 Лесоустройство и лесоуправление', 9, 2, '', 1),
           (36, 1, 1,  3, NULL, '2501005.62', '2501005.62 Лесомелиорация ландшафтов и инженерная биология', 9, 2, '', 1),
           (37, 1, 1,  3, NULL, '2501001.62 (3г)', '2501001.62 Лесное хозяйство', 9, 2, '', 1),
           (38, 1, 1,  3, NULL, '2501003.62 (3г)', '2501003.62 Лесоустройство и лесоуправление', 9, 2, '', 1),           
           (39, 1, 1,  3, NULL, '2501005.62 (3г)', '2501005.62 Лесомелиорация ландшафтов и инженерная биология', 9, 2, '', 1),
	   (40, 1, 1,  3, NULL, '110500.62', '110500.62 Садоводство', 9, 2, '', 1),
	   (41, 1, 1,  3, NULL, '280100.62', '280100.62 Природообустройство и водопользование', 9, 2, '', 1),
	   (42, 1, 1,  4, NULL, '022000.62', '280100.62 Экология и природопользование', 9, 2, '', 1),
	   (43, 1, 1,  3, NULL, '110119.51', '110119.51 Флористика (СПО колледж)', 9, 2, '', 1);

END $$

-- модификация с 0.019 до 0.020
DROP PROCEDURE IF EXISTS decanet.DCVERS_0019_0020 $$
CREATE PROCEDURE decanet.DCVERS_0019_0020()
BEGIN

  -- перенос 12 и 13 отделений с ГФ на ИЛП
  UPDATE decanet.division
    SET FACULTET_ID = 1,
        DIVISION_ABBR = '43.03.01 Бакалавриат',
        DIVISION_NAME = '43.03.01 Конгрессно-выставочный сервис'
    WHERE DIVISION_ID = 12;

  UPDATE decanet.division
    SET FACULTET_ID = 1,
        DIVISION_ABBR = '43.03.02 Бакалавриат',
        DIVISION_NAME = '43.03.02 Туризм'
    WHERE DIVISION_ID = 13;


END $$

-- модификация с 0.020 до 0.021
DROP PROCEDURE IF EXISTS decanet.DCVERS_0020_0021 $$
CREATE PROCEDURE decanet.DCVERS_0020_0021()
BEGIN

  -- добавление секретного ключа для 2FA
  ALTER TABLE decanet.duser ADD COLUMN DUSER_2FA varchar(255) DEFAULT NULL AFTER BUPASS;   

  -- устранение конфликта studsgrp.DIVISION_ID

  DROP TEMPORARY TABLE IF EXISTS ttt_slist;
  CREATE TEMPORARY TABLE ttt_slist AS
    SELECT STUDENT_ID, COUNT(DIVISION_ID) AS DIVCNT
      FROM decanet.studsgrp
      GROUP BY STUDENT_ID HAVING COUNT(DIVISION_ID) > 1;

   DROP TEMPORARY TABLE IF EXISTS ttt_divconf;
   CREATE TEMPORARY TABLE ttt_divconf AS
     SELECT SSG.*, R.DIVISION_ID AS DIVCONFL
     FROM ttt_slist LEFT JOIN
          decanet.studsgrp SSG USING (STUDENT_ID) LEFT JOIN
          decanet.sgroup G USING (SGROUP_ID) LEFT JOIN
          decanet.stream R USING (STREAM_ID)
     WHERE SSG.DIVISION_ID<>R.DIVISION_ID;

   DROP TEMPORARY TABLE IF EXISTS ttt_divstud;
   CREATE TEMPORARY TABLE ttt_divstud AS
     SELECT SSG.*
     FROM ttt_divconf LEFT JOIN
          decanet.studsgrp SSG USING (STUDENT_ID);

   DROP TEMPORARY TABLE IF EXISTS ttt_studdel;
   CREATE TEMPORARY TABLE ttt_studdel AS
     SELECT SSG.*
     FROM decanet.ttt_divstud LEFT JOIN
          decanet.studsgrp SSG USING (STUDSGRP_ID) LEFT JOIN
          decanet.contingent USING (STUDSGRP_ID)
     WHERE CONTINGENT_ID IS NULL;

   DELETE decanet.contingent
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.contingent USING (STUDSGRP_ID);

   DELETE decanet.acad
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.persprog USING (STUDSGRP_ID) LEFT JOIN
          decanet.acad USING (PERSPROG_ID);

   DELETE decanet.progdoc
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.persprog USING (STUDSGRP_ID) LEFT JOIN
          decanet.progdoc USING (PERSPROG_ID);

   DELETE decanet.persprog
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.persprog USING (STUDSGRP_ID);

   DELETE decanet.studdoc
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.studdoc USING (STUDSGRP_ID);

   DELETE decanet.studsgrp
     FROM decanet.ttt_studdel LEFT JOIN
          decanet.studsgrp USING (STUDSGRP_ID) LEFT JOIN
          decanet.contingent USING (STUDSGRP_ID)
     WHERE CONTINGENT_ID IS NULL;

   UPDATE
     decanet.division V LEFT JOIN
     decanet.stream R USING (DIVISION_ID) LEFT JOIN
     decanet.sgroup G USING (STREAM_ID) LEFT JOIN
     decanet.studsgrp SSG USING (SGROUP_ID) LEFT JOIN
     decanet.division V1 ON V1.DIVISION_ID = SSG.DIVISION_ID
     SET SSG.DIVISION_ID = R.DIVISION_ID
     WHERE V.DIVISION_ID <> V1.DIVISION_ID;

   ALTER TABLE decanet.acad       DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.contingent DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.document   DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.dsession   DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.mainprog   DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.mprogsubj  DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.persname   DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.persprog   DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.prolong    DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.sgroup     DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.stipend    DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.stream     DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.studadd    DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.student    DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;
   ALTER TABLE decanet.subj       DROP COLUMN CRT_, DROP COLUMN CUSR_, DROP COLUMN UPD_, DROP COLUMN UUSR_;

   ALTER TABLE decanet.protocol   DROP COLUMN CRT_, DROP COLUMN CUSR_;

   UPDATE duser SET DUSER_MNAME='Александрович' WHERE DUNAME = 'sax' AND DUSER_ID=4;

END $$



-- ----------------------------------------------------------------------------------------------------
DROP PROCEDURE IF EXISTS decanet.DCVERS_MODIFY $$
CREATE PROCEDURE decanet.DCVERS_MODIFY(IN CVER DECIMAL(6,3))
BEGIN
  IF CVER = 0.001 THEN
    CALL DCVERS_0001_0002();
    SET CVER = 0.002;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.002 THEN
    CALL DCVERS_0002_0003();
    SET CVER = 0.003;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.003 THEN
    CALL DCVERS_0003_0004();
    SET CVER = 0.004;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.004 THEN
    CALL DCVERS_0004_0005();
    SET CVER = 0.005;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.005 THEN
    CALL DCVERS_0005_0006();
    SET CVER = 0.006;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.006 THEN
    CALL DCVERS_0006_0007();
    SET CVER = 0.007;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.007 THEN
    CALL DCVERS_0007_0008();
    SET CVER = 0.008;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.008 THEN
    CALL DCVERS_0008_0009();
    SET CVER = 0.009;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.009 THEN
    CALL DCVERS_0009_0010();
    SET CVER = 0.010;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.010 THEN
    CALL DCVERS_0010_0011();
    SET CVER = 0.011;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.011 THEN
    CALL DCVERS_0011_0012();
    SET CVER = 0.012;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.012 THEN
    CALL DCVERS_0012_0013();
    SET CVER = 0.013;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.013 THEN
    CALL DCVERS_0013_0014();
    SET CVER = 0.014;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.014 THEN
    CALL DCVERS_0014_0015();
    SET CVER = 0.015;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.015 THEN
    CALL DCVERS_0015_0016();
    SET CVER = 0.016;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.016 THEN
    CALL DCVERS_0016_0017();
    SET CVER = 0.017;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.017 THEN
    CALL DCVERS_0017_0018();
    SET CVER = 0.018;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.018 THEN
    CALL DCVERS_0018_0019();
    SET CVER = 0.019;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.019 THEN
    CALL DCVERS_0019_0020();
    SET CVER = 0.020;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;
  IF CVER = 0.020 THEN
    CALL DCVERS_0020_0021();
    SET CVER = 0.021;
    INSERT INTO decanet.version
      VALUES(CVER, NOW());
  END IF;

END $$

DELIMITER ;

-- собственно модификация
SET @CURVER = (SELECT MAX(VERNO) FROM decanet.version);

CALL decanet.DCVERS_MODIFY(@CURVER);

SELECT MAX(VERNO) AS version
  FROM decanet.version;